pico-8 cartridge // http://www.pico-8.com
version 38
__lua__
--{GAMENAME}
--{AUTHORINFO} 

-- so could fit up to 12 images 
-- images = {

-- }
images = {
_img_formless_void = "◝◝ヲ○◝◝♥ト…\nミR。❎~O◝ユ`ュ\0¹ᶠ◝ワA▒²\0³░★<\0!◝ョまX⁴4◆QR$⁴$?◝つ\rBゃ¹▮」( そq²りᶠ◝Pヌ。A\t██░オニ\0⁴「Db9🐱⁸H○ナ░░🐱¥、Aᶠd2BA?TDフ⬆️░Hョaッりᶠュチ…)▮RkG@4⌂p-E□¥◀¥□゜ッaケ(ヌ@NWすFDヒUd&$Hむᶠ◜pCっJF█ELネ🅾️□E░●★ロを!¥#▥゜ろ=🐱□、る`ハ¥Dょ、セ‖けhウ³²pく&w#D$H○ニ♥ニ\t#🅾️`🐱□マT⁷う6C\0のし➡️□[□⧗\"⬅️⁴?X~p★、ろG⁸⁵Og@\"❎、セl9キ⧗B$😐GP◝くさ,/H☉}る▮□b、り➡️!dm\\pJXヌ◀D?☉q\r\r\n■ds@N\"\"きj■!:やル,PrHけ¹∧G░¹#▤~オミ☉░ユDFF🐱(t▒◀I4●tq(こ♥\nけˇし$AaッれチD'▮🅾️p⁵ A²¹ろN'⁴G⁙■#(■iコ◀G…ュく‖!@t⁸ヘっI⁸r█▥E▤⁙。⁴つ⁘ち░\t,⬅️#ル░░ヌ\"$A#웃ᵉヌ\"0マ■⁙³まHニ'u8■[ぬタ♥⁴ホ🅾️)□っュ!ム🐱⁙⌂➡️ア…@wきヒ➡️り\"BX¥\nそに¥Z▥xけFへ@ョaさCさ\t■⁘yG▮ヒDぬ∧  IらwZJノTっ⌂むE\tネゃ]ソ⬅️▮∧$D@★h!を☉ぬpB\"\"っᶠaウ\tj$さbD*ᵇさBれ⬆️ュ⧗そ^$★ ➡️ョˇ□!A4[&き%とR\rh…ナGハᵉ ∧Dきえ▮Nノ!ろ. Tの-➡️\"$ちヒ…ヒリエ6p&BNp🅾️dXhX▮c#Aセャ⁴ヌ%▶\"⬇️@✽bうの░*iᵉ$cル…\"N`웃🐱HHヌB◀、%Kる⁴⁸ん⁸ひˇ⧗ほ⁸q$pqt゜も&☉H¥ろ✽:➡️ヤ▮*S☉…I⁘'²p🅾️kK(\"タこっX!R➡️8²□GgPニ⁴D:のI░ヒDミKあまネ]\nAaホム░▤⁙▒dかひ6\"っ`ぬPの:Id☉●⌂MとRユうHュ゛²T★うY,CJ★,,8░ˇᶜ(あれA$☉★H웃cタゅRJ웃⁙'▮★☉▒\"ゃs\",I#ロ●しHヌ■I8⁴た,⁘░➡️gFたFNノt$⁘Qわ░□゜て🅾️!ん0\n\"$BっI\"N▮●∧hメRD&✽9し\"B▮⁴QヲるCそ\\、Bt웃ᵉ! G⁴&A%るK!Nノ[⁴²CTi。っラRE●ナ\nすそたD¥ᵉ◝⁸■に4$にd[⁘$YPh\tケ<ˇア웃⌂ヌᵇ■dADの▮C¹せm▮⧗aア:g²$きのA$Xyᶠカ&☉り▮あき1'チ⁸bオ▮ぬ、ら,●░HEHオ◝aaね⁴X…キ□9♥!、-⁴Lqᶜな-ホ³た-さろ}#スs#Bっ#[\n%H🐱、BA)▮Tル★け⁙░⁘B/pマ゜て%*HG□ Pw#ゃR■:♥R,!‖▒\"BCまhh~+8웃\"I9$░░)カe[りき,♥■くh…&▥²D♥◜lB⁴⁸q★‖◀¥■。\\⁙ラj█☉\t\"ケ…ュ!◝… ᵉB□‖、っシGッ★,:IP➡️ケ◆ゅ◀E➡️ぬE웃ね⁘ぬン,たᵉナ⬇️⁘ヌ\0LX(♪ろ;ˇ$!ャゅR⁴⁸4♪ᵉqさ=♥ネkした(*G2?レほ◀$▮CCそ@か▒ト■⁸🐱*▶▥$😐wᶠる゛BHh9➡️ま□sᵉ8たるV⬇️っ¥iけヲ⁘d4🅾️ニャるC7、ろF➡️⁴⬅️¹ま⁷⁷…ヌ@∧っRカdc▤}ᶠュひH∧Iケ7⁙Aら,🅾️lD➡️l★ロi゛っ゛C웃_チ░0⬆️ヒ★□8ね%GgHり!し6*B□゜Cヘw+웃◀\rQ(★$★HH…w█w\tるI⁙,⬅️⁘⬇️ラˇュCゃ_J□🐱ソH,H⬅️ s²Pe░▥n?」_ル🅾️ᵉし$h²$ᵉD@ア\t¹ね#HんDタaQノ?\t_ル▒わ*H ろ$DAPそ♥セ■4sろる7□$?」\\っ…◝!ろきの%\r\tRbNノ(ムうろ♥リᶠラ゜CBB$ヌ⁴⁴カ$➡️ろ🐱sd★d⬅️ろ◆ョPCそI]HJ…(░くろ★M$★\tふCJ▥と¥D●♥ヤᶠ!ュ\"D➡️⁸O■▮▥:♥⁸□ろし▒l🅾️ニくム▮◝ん!\"Ab⁵☉✽けゃ4▒く\0\"ᵇ¹ャBAᶠ%y\t#AIきˇaHk$T □▮ヒゃ²\0おっヌ゜ム,にソG⁘ち%⁴ホ …Mカ■□、\"⁘ ♥P◜!チにd{)#う★²2I\"$:☉☉¹◀⁴I□?「wᵉニュれレマ⁸★⁴h⁸た」¹8웃◀Hぬう¹#☉y\r⁴>♥ヤᵇᵇ#つ■⁵\0001\nE…B,░‖⁸~ラよX~R9♥pも⬆️⁵…4G□ 4HそDけ@ぬ…BBJマ、れホ゜░8➡️ア☉H²ャd★ ∧D\tPH○ユ➡️ケ8♥ネ\tろD…▒⁷¥I\t$4■⁸ヒ²HCョ♥…マ゜ノに-@G⬅️$★@(²…\tᵉく$I、るれ▤{ᵉaケな$qニ@&ら⁸Bt^▮<▒▮➡️⧗み゜CCCラ♥0オヘたメI⁙は!\0Hョさsᶠウ゜⬆️?Nき⁴\0I!³\0d★🐱H✽…➡️ノ◆ウ゜ひ▮ョdp☉■Q ‖⁸\tろ■BらXHs!ᶠ!くろ$9ˇヲるHフ⌂웃!!t\" ▒$Mオ▒り■#はゃ、れ웃]れホ_░な▮🐱I▮⬆️X□き□ゃ‖%りろ▮ラ、れ웃_ヲ$~▮⬅️□Dᵇ□C!⁴そY'5ᵉbᶠaケにウGオョニ:そ$⁴<$!▮2ᵉ■、ヌ▮C▥]れユ➡️ろ,<░♥*D*4F✽ね\"ᵇらK$s ~Rよヨゅュaムそ☉あ\"B、セ% 7H░¥⁸!◝🐱Gヤ)#スK@L♪$お■*Nっ☉も$웃ᶠヌ。れBれ◝「G&⁴∧Gtさ★&@웃²るるっJュさH○▮ッ▶☉⬅️▒ら,⌂░d🐱,➡️░もI⁶☉★?⁸○0ヌ゜😐,(I$ムY「I⁴キ⁴#$J◀Dモ\"Jキ?◜ユ(∧,⁸T8%⁴X█!ソ,⌂]⁵♥▮ッ。Cヘy²!わすHshE█p…ネ▤⬇️q▮ュさq\rᵉしw!ᵉノMKウこ웃、▒⁴⁵E$ぬ‖r■☉HCっhsᵉハ{ᵉˇ\r)ᵇ0YRゅMw¹!ᶠ\0!ム◆◜スM0#🐱5∧r■▒3░'ヌ4……ろ,?ワCぬVえ⁴ホ░4▥4すマ$●░▒「?⁸Hqᵉ!チ<ˇコ⬅️□L▒V⬅️ᵉも…⬆️p➡️\tdr⬇️♪■4Eˇろな!dI。Aᵉく4のD* コ'Q%♥r⁶:I⁴♪#Hヒ゜チ?=\tlきりh★*の□」!ム*ウ¹4Dˇ%w#◝ᶜ🅾️jHMゅラ⁴Ja‖Qノ▮ぬ'⁘な\t$そひ○…ョ …✽も▥★EG,ナ•Z⬆️。ヌ'♪ □◀D…➡️%~2>░♥「<サqセりBEG‖3%▥ヲ⁴▒)=¹ᶠキD♥★め⬆️ˇ❎░へENオA!そ⁘ぬマ🐱8*4I:…BGT}+ルッそ⁷6゛セ\"⁴チS🐱らHHN)dふ…∧せ◜\t^HオモXI(★くᵉ9け6み AンJナと=★ さ◆ゅG★,$♥➡️DIへYaろ▮▮Aす★♪$wち⁸ょI◀⁴゛Hオ★よxwmnRH…マA\t■⌂BdI!#AるK2$9\"¥\0➡️し~のまルそ➡️%ちニ$i」Iよ$アs$³●b□³「⬆️D⬆️w#Hュaテᶜ\"M\nひュd²⁸☉ねる%F☉q\"@ふIよ4➡️⁴Drかて<ろ\"%KeQ$vT\"⁴★Kむ▒8@ヒ\"8さ∧/あ!!*HAᵉき⬆️ね\"⁵りBXぬオヌ웃カ²W⁴みひ♥∧▮⁷3\"Oら\0?リ□HT웃d Mᶠら[\"8Aヒ●ソIろf⁴うり⁴@d⁸ ˇd~ルさ☉ょE&こヨヒ\nRb.ケ-、 ♥⁴モ□H…□Tˇろ,▮A+▒Q²と$⧗ワ*X웃Imˇ*█あ\tち²オ웃ᵉ■\\っBれユモ(⧗░\tb⁸!!ラ■!ろJあノ□れ✽へけBス☉ね□'0³ワ░@I*セ+■ンA☉!$⬅️るWなふニ▥\tᵇ」1□◀⧗゜😐🅾️!!),N/⁸ニ\"○A$웃)\\ひa(キ⁴⁸ふ,⁸%✽➡️aaヘHうしキBBD♥ニᶜ□%⁙G⁵Pヌ▒0⁘웃ARP☉XXs\t\"$➡️0I\n⌂~8'■⁶!2ノ%と⁘pR$🐱•⌂Iンれ∧b.☉I⁸のI#そ|`$p/◀み●TゃEHへQ⁴ゃ□Eりl□□5☉BI▶▥$…$!ヲり☉Dう⁸え➡️mNᵉ8」alI&⁶し$⌂$pn\"‖.☉⁴ソᶠゅ。∧D☉チ.Bょ、_▤うTJ☉コわ& $@nけく\nくD★J◆ロ⁘さD😐なこz⬇️I8B。く⁴➡️!$⬅️Qᵉノ\n⬆️D⌂ヌDI□⁸{\"ら웃ᵉろ ねnょQ カね,ち¥T♪$8…◆P⁴ 🐱!\0D◜$z▮`2p(のhハdrqi」➡️⁸…\t*Bn░⁸\n░……◝!BTた□けケ☉ね、ᵇ□まH%Y、‖'ね$A ぬA$ロGメᵇ ▮P,.へw□█+\tょ8i⁙■➡️さ⁸⬇️D!そ……マ゛Cヨ⁸%Dゃろ♪▮웃kR(⧗◀★%●らd@➡️t★¹aム◆ソ。@☉█░~)■ˇbt‖'ᵉo⁙n、4(★Dᵉキ□▮h4◆ヌ゛れ▤,⁸5Eもs pヌ⁴hu+リ∧:█Hi、Aᵉ!ョヌ▮ろくdo▶웃N」■□マ▤ネき□B*□DオH{ᶠウ◀゜░$¹#□Nᵇきた\"!'ち8ナ*ん▮★は░ヌ⁷キ,◆を゜チ4웃\0G²⁷7F☉⌂⧗\rな✽■⁘さ★□$□=…♥ャ⁴.\tᵉB$🅾️`!'$r★nヲeニ8ネえ'⁴Cン➡️ュBCヲノ¹∧%➡️シ=▶⬅️、□-ケく$Cロ➡️フq▮s#まsᵇ⁴8➡️▮⁙ˇZT\\⬆️\t😐2CD★⁸XHcトまフユフやヲレシニイ?웃クむT(p³GEネ❎ノ⬅️RD`マ。るる◜⁴トsヲyエお█\0",
_img_scientists = "◝◝ヲ○◝◝♥ト▤3ホヌ◆くTレ🅾️○◝り\0\0\0\0\0\0\0\0\0\0\0⁸ ♥ャ🐱゜ン`♥Pぬ◝れ⁴?ᶠら\0▮ル⬆️\0♥メᵉ`♥Pぬョナ█AᵇB²³ヨ🐱¥░▮……ュく◝を⁸H ら5ᵉ█ ♥ハ\0🐱□⁸○ヲ🐱⁸!\0\0r⁷メ\t\t🐱A⁴²⁸H~ぬュaケ▮@ ⬇️²웃\0。\0A⁴?(H(Aᵇ▒ᵉ!をᵇᵉナ●🐱□⁸ らら%⁸ᶠゅ、BBAB。るるAᵉ!pXs⁴8🐱゛²ᶜ\0_ら\0▮ぬオさ⬇️²⁸}ᶠヌ⁸s⁴$,▮B²²⁙⁷リ\r\nHX!ッれレ♥…オ@ !ahAヘ\0⬇️⁵:くᶠュ▮◝エᵇ▒█⁸(@¹っ9⬇️…³²゜ンくョC▤qᶠ⁴⁘:¹`♥\0さ⬇️⁷◝ヘhXQ\0░▮⁸ᵇ⬇️☉! \0…◝く◝ちᶜ⁸ █▮A⁷\0⁙⁷0ヌ³◝⁘,▮A⁴▮◜!@🐱\n▮Aᵉaを⁸9¹ᶠゅ⁸ 🐱、り⁴▮A\tᶠマ⁸0!0:\0ノ\rᵉろ:つへ웃▮A\tᶠスろ♥ハᵉ!\0█³³そaっ□、^71ケニアほホH 🐱⁸C(□GpBAᵇ⁷\0う¹ナ²r⁶▮ナ,▤tキZふP³\n▮A¹4メセ\"くウᵉ!き█ぬュ⁵•█0Q&ソyエし‖@¹‖\r⁴!7♥◀ホ∧YュAF★J4█²\t◀²ラ웃オ➡️ク」¥(⬆️😐⁸@ᵇテネuワ、|hカん▮ヒ◀⁸⁴もんうウalゃᵇナ²_)イ4Jルˇoと#!⁴⁴●えろムか⁙ユ;は⬇️゛るる\t;のiz.ツょ▥🐱▮BヨわニDもki$ミ▮@H😐◀ラG2q。j⧗☉ヌ‖ンᵉ🅾️/◀pK@シ웃{e\n■⧗²Y■6L\"8p⁶⁴ 🐱^。ヘW。よ²m「oっq$ま…qᵇメノ3s⁴★²I⁙🅾️。Lあラさ⁴Hp■B░³て∧9ほ☉[c%.▮ルK░へウ$せ@⧗rウ:PYV@え9∧スホ+Eら✽⁴▶🅾️%は🅾️WqウTネ▒#░9▶お6∧け\t4スカ8^ ⁸ ネ✽も⁷²DBろ⬇️²²²^D▥mノマ(pな\nと⁙さM1\\BはるLあQキ🐱pヌユえpセ,は、J「◀ᵉ\0⬇️L9🅾️38…ハウリQ…ヌ□てKN▮N>いお$En*@Tさ73-ナりエGI8\n$⁘\\ᶠゅ➡️'チUrᵉᵉJEきA\tゅslsほ[けd★すへひ웃り(□Jイわ➡️ょ⌂^PI、ら☉そA⁷Vメb^8は웃[#░つ」\r‖xEフ☉Vナ」に、H:pウ,j(いn\t\0-░ほ∧$²◀⁴N)$キDいqIjqQdT.[□rも▶せ□qのセ&★pや‖(,@キ∧き🅾️2Dナ⁸L²s4やgうqyクいク🅾️\"⬆️░A⁵⁙ちイ\tり、D⧗Xタ$▮む²のくけわ…た□GS⬅️イ⬆️き\0ヒi9はろJふ%♪ん$てヒ∧Erスさᵇ♥!8⬇️●fちtqさ\"テb⧗Dうりりる✽⁙▥、ヘリ-G2dUヒ@て¹れ,nq\\+☉ノ♪るpuV$2ま⁷c웃VユAP゜I★K⁶░p⁸ウ[}i⧗⬆️ヒ*おuんᵇ\n░わHのスV➡️\\に□ユユaをスY]れ9つ8⬅️\\み➡️,Dやx\0~³\\そなルぬう9コひFH0Bq★jな⁵なxと4モイP⌂\nもRりロ★ケu1。マめたなえ{る✽⁸♪し⁸ やnRnxキユrP😐アのBし8B)VN/=□DRりタせSq❎bを\\マ W▮ラX⁴‖!れな/58TゃYアリ^c⁷こ]V░、JJナ⁸っ%░q\\⌂&うL▤ロp'\\²Hぬe▮tヌ∧タに\tVY<jR♪‖ンリさこ█Fと🐱◜6めヌょ□」、'¹y7⁸Cせ3JI□D∧X!2m<フ♪%LヌヨてnうW¥XN⁸ニッ、&サ]んᵇれTょZ⁙⬆️のpdセろq、○3\t3░8q*\"∧pQDミ🅾️dネ▶えょて🅾️$のgも8🐱◆Kるウ*I☉ヤ웃.…う。NKらニハ⬅️TうまYろキとみ\\pPMl▮¹JH⌂や4なᶠろウみミすもうこさ'\r:⬅️シQヒゃ■ヲと★ユ¥eW9&\0ライエ▶むは☉⧗#み‖1⁴▮⬆️★マM¹PZ6ゅYˇPxD5)…+8コ!$4ぬYl♥1ケIあ。コ8キH:オAB⁷.84~9のリシ、-ゅまA⁸웃ろN⁷■★pク,pほ🐱s•❎「…Y1゛⁵ヌく\\ゃKyヌす8²¹⁵…み➡️❎+つひコ7、p⬆️☉Yさネpふハへすネ░✽🅾️VちA`マコ、i^%フいア4♪n▮AᵇるえよN7゜⌂まのウTフ█IるょょハうN&¹]Vtはほ5アしムuとけA-yルくとは☉りD²ᵉ@sな~1&えノな.\"V⌂ろ⌂けて♥ミらチ4スm\\H▒\",キラ▶H웃ツIキ²q\"■,▮キKえ2[.ろ⬇️■T▮Pキ,ウg²sM:utAg\t-2'uく、nt\n🐱iエお:ヲ⁘(Eyれpヌsこ8G%qL🐱²Mア…「む□Zヨと▮モら▥'D、セ4!ᵉルJえ▮⁸⁸\"よ⁘▤うVうNd☉⌂🐱✽#こ•✽Zh■lとpロN/■るすt&め_■%ナおそ²\n⁴g:qdD∧n□◆•たら⧗⬇️웃ろ⬅️9◆9そマwJはふl⌂コりZq9NNg#🐱ろiく⁵ソA⁴▮@‖$☉つˇᵉ.チせ<ゃ0.りc…\0^8ニシ□ユC♥、マ]‖き░j⬇️░KA⁙✽ノ⁴▮□D8W▤★ろ🐱*⁸たB\r%★L◆□シ⁙⬅️ろう^8∧MIオつ□\n✽なds▶ち²⁘⬇️FそZヤ●ソ∧tは▮1bDn'◀\"XねT➡️Tほfq⁶;ウ9け:8▶おヤ7nf ら2ON9もマサHサ0v)2ヨᵉz🅾️さ∧マeそGSた▥$░ナ⁙たeハるsyfテリ\tテ@:⁙#ヒイウ❎pあ∧さd、みiるシ/。ユうモ$ハxKt…♪2G<!ケq⌂ネ!♥きᵉEう7.⁴8kUト、サゃ⁷\n¥しNHウひさハ9つツ■%Y🐱@! ニR\\をろノヲ~?웃ᵉ{ニをうゃIみpウ$チjくnf9³웃░うホょu4け⁴⁙…、はLも\"ケHuxusヨ!#∧もiう、%=うeE0JチIそ❎✽ujテ$Dろ⬅️‖ヒ█⁘H\t⁘T⁶Hュひᵉ\tるラ⌂ソミ◀゛$な3,ホひ▤a\"テo¥pJ▤、⁷(🅾️+🐱Vなし▒ヲゅチYんUウもs\tG\tわいi$ろ そYIsxみトネ[ˇウ,ろ¹%⁸ ヘハEのヒoくメH1⁴ヘユマタうわむよᵉ-D✽🅾️゜♥,テ_をqをかN5もしすb`ぬ|8フえ-🅾️ちVSヘ$h4웃%☉カヌたj웃+▤Iこ웃ケ。ア▥eカd¥ᵉき\0웃849もちdルEヤIレ$ホ▤❎🐱•▤⁴\tzうUソ9i\\ウRlP▮ぬA\tzるEけ\nヌq*r⁶\0あ,サの■ひ⁶✽Fm%に⁙😐•웃K\"ゅ\n,-¹シ□IツEうらsa!ぬ! Rて、!□70⁙…むひf★gs⬅️らふm□⁸(\0:ナのロうEは🅾️‖ᵉユ^★ゃナょyゃK,も@ケ¹=I⁙hN◀ヘr⌂\0⁘QFe[&³▒しXs\t¹l➡️x\t'zh@ノ\0008eナg▶た\\C⬆️eナ\n'\0ᶜ⁸rナハtr⌂▮ヤ⁴⁸おA\\に⁸J$Ps²8Dゃこ☉qZEひ\t▒\0きiっクTう*□、B`□エ&ヒqすにれい-\0009けテ8@、…ハひた1\0⁷「⁷わうせ▮$▮C█HュᵉSけ‖ゃ¥AB⬅️⁴ ヒ+d▒I;A(8⁶くᵉフ⁴ ぬ……³お\0ヘえ‖4j|`●▮さ%tN🅾️8uょ🅾️.ネ▥イナ…オQイノムカ$「-²@ちd+░♪■⁵\n、⧗▥gRI@bNへJ(C☉⁴9<、█░きH¹ん{Nm4⧗A⬇️▤Aわふる⁷7$🅾️IZ⌂-\n⁷⁙🐱⁸8▮りヲ□⌂■⬅️\\さ★h▤ぬひKる★スMx⧗Mふ、@⁴8<'\0…ま%▮🐱\t▒?*キE♥\\²Dう4セれ▥!E█Jん…²ウ゜DCA⁶ᵇ🐱a⁴█⬆️HR▮…うヨ☉⁘✽◆d▒ゃア░⁶$なF▒@う▒ぬ!;Lミ✽∧∧Vナ⁸UL4タ●⁴Yけ□R◀、\n?j$⁵ら●りり6Y웃\rナ¹▒;キラJへn\nた$ウ\r⁴8うゃᵉン@Q0!オ8た5✽➡️む\0●¥s:⧗☉S8Kc😐せ$ら●こ▥うっ█\0Cまp$ね Kᶜ9¹オ[ミY4もpおg•UMD$,9ネI。\"▮ネ…<♥8)ぬj▮CG.$シ/▶Zケ5ひ9?⁙Lミ░▮A⁵゜C♪9g▮▒く (ルiトハ、8]#qdN$⬆️✽?*ナp9ˇ\r⁴「9りト。す▒G▮²A⁵ᶜN、メ&ハヲg\n⬆️9?0ネま(ぬひᵉp!`モ[BTZ⁴▮@、;'}セゃアモヨエ‖R⁘ュリ⧗ま☉\t\tっ゜²r□Q@P⬇️²³エ[Iサヤd★っBえA⁸'ᵉ=サ\0オP>⁶ホみ⁸!⁴、▒ 。█^xネいろ9ᶜ「ム@*aシ⁸▮r²゛れ▤!`░「⁘(▤Aぬgは@く⁸q⁴、🐱◆□▶█(ロ█きA\0ら⁴ナ⁘▤▮ヒ¥□\n⁷@A⁵ふアF⁵█P!ツᵉ¹ᵇB웃B▮p\tK⁷ q▒E9▮A\0♥p…P🐱⁸hZ!;\0``BP✽³Y、ナj:♥▮…う⁴゛a²🅾️!ろ(き¹░ ✽ら⁷゜☉ナ⁴s⁸I」)⁶\r➡️9き:\0きhZ$%▮\n/\0@q\0⬅️\n🅾️ ¹ヘナ\n⁴さ▤⧗A¹Iら▮pᵉ⁸\t█(、。オ░「8@♥□5🐱✽▮ノス⁘L\0HX⁴⁴くナ\0:¹を\t⁴H∧\n@4😐*!\t\t#う░웃a8\0ヒ⌂⁴⁷▮ヘ░ ✽✽…➡️!`♥⬆️ -⁸m$B😐ᵉ@Cあ4「、³お@ス0,$&⁴?*\0ネ■ん(▮$ノᶠax⁴🐱░⁘b★░▮ゃD◀⁸ᶠa(t³スQ\0█`Bるオヘ²⁘▤⁴りpl★!@⁷zくᵉ\r⌂vD🐱、H²らᶜA▒ス⁵り8⁴▮░「H!G\0ノノひ!□、@!ᵉ⁴0)z\0🐱、「🐱\n,' d🐱◆9そ⁴7³♥◀ら➡️&\t▒\tᵉx\0ナ⁘⬇️オ²れ➡️\tc…$$😐▒…p⁸C➡️っ⁘を🐱¥☉ ░きBQ█░(⬇️ \0Qマ⁴)く$r,⁘8⁵▮@¹H ⁵8░$⁘ %²B\0Y゛け◀▮Cゆ¹ᵉてH く🐱オけA⁸A¹⁴▮█`4くGキし🐱\n\0のた2ᶜ▮BAᵇオ\t▒\t@▶⁴ ▮⁘▮E…ョᶜpJ🅾️j!Ae$ ナ□□☉ ()h🐱²Bナ<\\ ˇノき⬅️⁴ </\0ナろ♥t(ヌ웃🐱▮…¹ᵇ\nJIGニVD²り☉Bし\0…ˇXみᵇ\0▮…▮⁘ヌ✽\n:█ヌWヌY¹⁷\"、ろ…⁸dヌ웃⬇️そ!8⁴✽、¹ᶠろ゜ス█ろナB□れユテs⁘きメ⁶こスXN@ラ❎ワYB□◀ネ🐱Pりふ…\t9³そpqᶜJ▮マ゜⬆️にイ)░'⁸:➡️ケ░え%✽P▮Cく⬇️B⁘も▒ル8?\"▮…v□、ス(ネいみキま░A⁵¥▮³りら?た_ˇみ‖D-BTゃ\n:マV\\オぬ⬆️s\nHyᵇ▒⁴<░の?y⁘セa⁸cたた□ラ☉i@Cね@マᶜ゜ろ ˇルq$p な$lᶠ&イテフ●っE□▮C゜😐8♥ヘ⁴る~の$⁘K`bHレキレI웃ᶜ•█⁴▮ムP✽♥メ#ヨわᵇ⬆️RN 4゛Bm\\はBクう\n⁷ニᶠラ□こヨH▒⁸8「☉?rYQ⁵▤L\0りム▮◜ム░;ヌ🐱U█UKaR○」コrTさ♥ニᵉくルつ\"ゅッRW\t⁴⁵ˇさH~W◆9ロ웃¹ろ□8…♥リ⁵みラ'\t#☉N(ZAンHQヲ、っ@○★?ᵇᵉaう,ひ★☉◀⁷、れワ_Nᶠキ゜ム\"IUxほ웃キ⁶⁙웃、Hョdx^▮w#た。っモさチIdッつJBKB∧\"W◜R゜¹lかI\tdu#ゃ□▮b$⁘-ねるれJ◜$q⁙⬅️ᶠl$◆ゅHOしIはトゅqアほ✽、N@ち♥2ろ~ufぬオそ,?み◀。Tう$もヨ◆▶い@\0",
_img_torn_asunder = "◝◝ヲ○◝◝♥ト▤★ヘ&•?ツO(う²カ4そムらtニᵉ゜ゅ⁴█る⁴:ヘ\\☉X5B'ャア\0ᶜ&⁴³とん■ ★くx☉▮いM■らょ0\"ウ-ニ◀*∧CュさIるっKとろ⬆️へ/ん◀∧🅾️Efキ⁴」し@のノす゛チ⁵Zアよイハᵉ\"Kれ⬇️░つケス8ぬP⌂ぬ▮웃`ムkTの)Q`⬆️ネX◀キᶠミa」ヲツ Z、★ス⬅️ゅウD\nく、■`。◀っsたろR-▮★`1ᶠすs²\")ゅhヤ⬅️!ふ∧\"░ふき∧れと8ちG\r$\t⁷¥フ\rt)☉Z2マ➡️!▶█@⁙ゆ█そちd❎4ネけ,すQ¹rq|❎$けイえN0Rs▶☉fN⁙➡️⁸~ᵉBc★⁷▶▒e/¥ハ!\tトY、ス⁙░たうゅ]`サるFフ웃‖ᵉem!ウれ³⁵もDpえウ³fumᵉ\tウもq¥nVjヒコ░あb▮ニ!」$⁸ネと8★R⧗テ2-qす⁴;ヌ∧ョ⁷R[★\"さuろIKろ&6 うqしQ★ウろH\tQ6⁵웃■8X⌂⁵゛、J。웃り\\¥テ\"JノれしᵇらKん¥Cbi🅾️け!0<、F▮Yけpg\0し░ナ^$うUv⁸K{ニW●●I;゜🐱ᵉ8な‖イチpネ89♥ミゅ ヒぬ8♥⁙っ➡️cサうXゅ8⁷゛コN]ヘ❎,8らさᵇ9ヌp^\"ko⁵う▮`ク▮◀し░e◀D…|Mわつ、Ag▮5そゆ+$hiRろ]ろ⬇️Idˇせᶠをホ■Lチ◀⁙tこt★⁴Gナヘ⁶jエᶜZ=もエlX5^eクsI,かD⁶➡️8wて⬆️つ:ナみれ⬇️いト🅾️KさN+やJY6ˇら🅾️/<#ょソ~\r:d◀ZニrOすはユ★ˇ\0T♪+▥•ウ/❎てJろュ³🐱ZIめタ⬅️」xヌみい⁷vとはユ❎かる;さ☉~MVuに<,$ナ#▒a-⬇️Hうlチpゆみ⁷にfᵉ$ラ⁵u²'a\"ウまあ~\t&🅾️➡️Zょ□ウ,BっN¹~イmケつ²ヒヒ、ち♥Z▤⬅️ゅ,Yツけろは[xDた⁴オGᶠカわqろ^ふ\"HlI□#チさの◜\r」hOB+⁴◆V웃,えぬ…Xしさシ♪っ[9▒り■ᵇそ∧∧フヌせネ9ゃ'(-8キう³²キヨo3▥ゅw□qょG\tうEjれ❎$コDカ)*~⁵ˇ∧L‖:e Lた⁷웃るテUる\nチA⁷]ひᵇツ\"9ふ%';、WsYs'Frし⁴Dしね$は…A!ケノめい`\0ほ░へ⁸D░*/<rD…ほちヒI\rG、りめミ◀ちpか✽ろ%ニy#⬅️9]んやEもゅサTf\tD²、Q■xふつ😐BHネ8~\\K$rセ#u6I□なほムの🅾️゛S🅾️%ふ⁷\ty😐みコ)⬆️!ᵉ!ま\0😐▶8‖xス9うrぬモ~□Fカ%░ydつにネ%웃り0コY□rqてヘqらXQGホ(✽★fたᶜニ\"D[\rxフ⧗」イマjtね3そょサ+♪6け:$pえ%³⁘⬆️⁸(せ)¥てtめNdニh⬅️g⁘ょ)あPヨN1▮⧗D➡️5は★Uヌま⁴▮¥⁸H\0⁴りり■キンみた!Lヌ8s=キヨんᶠりれそチZ)⁸う$おゃイqるけdQ8ナニhナ…□░ ⁷⁵ふ■🅾️゛ワろう@❎A$ナ🅾️zあ■ツf░ヒろのH░なしはˇリ…ᵉき🐱\n「▮QᶜイれvKん¥Lヤᵉ「マょ\"ま웃わY1せ◀'+ウ%⬅️`9D⧗▥ゃ、マ⁶ %▮し⁷7んpう+☉み9A;p❎♪、\0ニV■&うB⁸pふEIまヌ'`¹D🐱⁘`●9▥wLq、はん1'.nも□ᶠっN;❎s'⁴(もG[🅾️1らc◆を웃¹イ▮C`タᵇ゜F➡️ほTキ⁸ケY⁶…,DマSみゃこ¹ウ0,、▒セ\0001g%゜🅾️チ:D□⁴▥Qケ⧗た,ミとむ웃'ᶠoノ'BっS🐱@HB▶⁵な☉!ぬsりん0、スさX⬅️'%ぬD[Aわ⁴ウま▥b,🐱🅾️\n00\\□□。q░や\0웃ク▮たさtᵇ、ヨ,\",うしpネj7*⁘ひj.⁷ !ヲcケ<ワ➡️ゅ\"Nl!ひN_░█Jナイアハ!せt☉!a◀…⁘Q⁴<♥♥リ9たょqヤ^☉%エまᵉwwけ$🅾️웃Uテ-せ⁷'85゜¥•□y piカみミてうシ<9 sアK,ヌ'1🐱T➡️⁷30ゅ █オAらF……✽こC▤ᶜリたちpD94H▥$ヌ⁸ヌ░サ♪イB🅾️ナりン³ニら$192▮モs8~53Vそ¹。$、ウ9uム&●ひネ…「?「u@ろ²゜░◆よ▶|8ネウxュあゆミあネなg:>?'R@uく!▒シ□⁙ス!Hvょ¹ム◆ちuy%も▮ゃエはつをネI■ トひ,$くくソラyソr★$🅾️⁙ヨwk▥。?$9ヌヨん◀ᵇらはえア,$%Ej,*x★□、A▤…🅾️5ホ?⁴チまヒq、j~+せ:Ziす⁵^そ⁸ud█qっ²#░♥U■$😐✽ッ9ゅpラ'\\Iりvナ=,⧗9こ▤!k█C2ケヤ…I&@うれ웃⁴ハ?⁙いx9ほ▤つん▮な4⬅️bᶠ*░っ⁙🅾️\"G(★I*▮Qる+$▶☉ウ?⁷=は●ヒˇOウ∧ウ\\e/0‖.コ:あwf♪²#ˇBナ.ニ$ュIし○」みゃQっdチ;サeい웃(uKさ☉けユc🅾️コ$Xゃ$BナHN、4⁙😐カニ`◜●Ntヒpクた7<□'、■」る2I \t★AF🅾️⁸な▮モこ🅾️☉ノylYゃト)\"s9&ニmクい░Lいえ6レと▤\n☉-G0ツさ⁴キ⁙🐱⁙⁸😐…\"Yょん\rネ★□♥、Ij]に、pノュ🅾️e8]ちヘは☉J\t\tP🐱\rdT▮え ♥すめ🅾️⁷0ヤ⬅️ヲᵉYxヌまはめるヨ\"^゛ここ⌂もIBゃ\tし⁸L█っわ▒!■■at웃8🅾️1⁸|ュ{フNo9eっ♥\tK,rあをB➡️ろqすフBJ🐱B¹Q!9★ヨ4ひᵉS웃#Nほd♥タ♪o、 ZニレうLいつ、^'2A8ナ◀Aらa*H⌂Aわq▮pY。り▮チ.チ[ょI_⌂Kシ2-ゃcアマ8もxヤm2C░★2p4の\"Ic²➡️⁙⬅️8❎⬆️そE✽ふゅつうカロうマ웃ろスN48qふ'⁙そ😐Z⬇️▥て$ZううDBq,♥\"ソ★DS✽ゆハネ⬆️ニろヒ~■ヲw8Oょ░8●Wo.i*✽░ょ❎☉\n9FAサ、ら$へしの9+Gやしナ⁸{゜…❎♪8゜◆。Lサ웃ン■ヲrヤふrう5ヌ/¹んS▤ミ★I⁸fた³ち…◆■エ。sy{をふろpDリ⬅️むネ░uエI$Uセ-せ/わ。K\0せ$タs⌂8⁸)3tA⁶\"p8░Kタ🅾️dチまヒソHヤになqんFシつguエ゜◆;まハんUりこ🅾️Rしノ」ZF¥ろqᶜzsᵉn⌂g➡️るNtYトᵉ8ニ3W⁶ネお'\\8NUケN■▮wN.pリ😐もg、O*H9マ,ナねさた8☉😐ロウ7、iFdEうgVˇPk*え*リIこ▥ろ@I∧ウ□s9ネ웃イつxナニ9せ、H⁷²Y■-ぬ➡️'³웃ろ▮!5⬇️ワシえにᶜゃろも7sな◆R⁙つx^)8ウチむえeネqまイん⁵🐱うEˇ$p…☉ネH➡️ウチvにゃBW¥Yz➡️。。9ヒリ?ᵉノY;^チ,えよn9ツqxむ8Mまウxら⬆️ニ9➡️¹³░r░,●とて$G▮゛5ネ🅾️-た#ユつVテ゛<EマWホ8sアヌさrや6ノY5…ᵉ'<キEhヘ²P▒。Eシ'|Fア\"さ#∧タ⬆️S웃わウ\tれゃ\nふ`Xもまprキq▶Hらヒせ<C☉,/Dヌ$$★%キさ☉웃■yrゃょ◆▶♪ん¥Oゃ⁘🐱ろヒゃ^sろチX8[⁙え/⁙ᵇヲタ▮わ*⁷\tの-カ¥ん□オsエ、sひqをハ;░ヌせ■4あsろゅW🅾️8はp;M□\"まょ$う0ヒ🐱q'3Nえ2¹■。ユあけま|みるpR🅾️し☉%¹.ヒsノu+웃W▒んN⁷|コウ7R、、▶ち∧Cウc⬅️K⁷‖9▮YBM•え%ちマUえQア]8*GネをFヤ★cゆ8ホ`✽♥ニZ✽マヌう(Aれˇsケフ✽タqゅリアˇょも7<こせ3おH♪。Wナチ8うTふ'vユG、テ!,ネqゅゃイEwd³4qきやテnsᵇEˇケラM8e⬇️ユN&🅾️てヤIエᵉせハ{ネ、テとpえd;p▮▒エ。◀ヘG*░い∧ひゃみふI)~うゃ:ふgツヘt⬅️cさ`ョ8ヌrゃ9ウSい⁴+🐱タをeたRd▶あキ³🅾️S☉❎❎vまチキYラさ⁷ネ5ク[せ3¥9wわつ4N*ユMウ▶★A\tりxみxせ■&sれ8た、4\\q:い🐱ゆニんᵉ(⧗░ナ…きせ⁶も,tネ♪vymヒ█8ミ$Y\\ん²d]エ⁶•qksク❎★qw\nャkんᵉ.HXのsB▥チク░s+pI/\tF8リ4∧ネ@Ausま+ゆ+😐むtネ🅾️x❎ラˇ'⁷❎🅾️8め★!0へh5ヒ∧sSᵉ、みDホ8いえ⁶4うゃ■'⁵い%なてヌ\\2◜:すか1\"ほ⁵D、りン\nIさ❎♥ハこょろネなvqa%kん\r4EKク🅾️f∧オ\"せ<82bM~Nxa$p⬇️ミへFMれ🅾️Zうk,-[]n⁴eCt⧗wb-ゃこ▥'□sみ[ルホょ♪uq9xニふチ,q.もこ+sゃ#なVKうリへ✽へまほᵉ(た▶qKエ³Oxチリをロpョなさケた!⬆️,ク▤ワな,ˇせ、むりわうmん\0ラキˇ、みナあ}へハセ&~0~、ウs♪サウ'\\Nとニ%9u▮ら★]わゃほ]‖ᵉ□pn◆$けS☉~s;oれ☉ᵇせ⁷■、qツヌ'■\tエᵇょ●こN$ッqケも8L'⁙Em'⁙そニlL∧9ュj<ヌ=Oをᵉ¥HTせNdウ²□⁶h☉9[%むラエᵇわフ\\ぬVゃ-6ᶠすゃあTうuロ⁴ᵉgハひqへネ⬅️⁷0ヌあHか█\"5の░♥ニまな\\Zそ★そpCユ⧗わネYobI\\J⁘\nE★ま🅾️⁶★E░は⌂ら「TカZ&VYま…Pうtrもiコナラ5はん2⁷4I★¹xんのレアq9ねゅ4きr6nう¹まHレ6⬆️vユn*D⧗Txナ★웃@マ➡️$ひへフᵉロやセさ*2🅾️\\$ハチ⧗g⁷❎🅾️5サシ68ろな\\28\"U=チiっソXBロN\\\"R9█nb+☉pモk+B …H😐^うHわ*rp□7Cユ'\nRyろN&レ❎M♥▶L#'=⁷+zオ!」ん⁸つ.★B★w8Kう:ひ♪$.∧eNひるマg'ウ🐱Q⁙お#MR:のKら웃c]を0Pうrマ2NNIうけ,フ⬅️²♥な%……カ9🐱□Q⁷✽➡️lヌ♪g▮のテO⬅️8ヘH~)ろˇこ□/⁸W…p✽Bしフ{ろ░のp∧ᵉまkわvうH⧗まOZ⁙☉_$qFk5っゅウ5Sあ▒qL\"むe⧗。+Wハ-ˇ5ヌ⧗@>チゅう⁙なニ4Lレエ6hVヌA$░ケ🅾️ヲのヨ-★サちᵇウちを[‖8^、U~◀6ふn⧗ひヌきスO•\\♥もさニるりbP◆…あ\nタs‖めslヌフょなつ$IVVGるタKわネい'🅾️-●ˇす8\no;ヌソヒろk、□ウ4⌂レyヌラh'⁘⬆️Iee😐ク▥\"■ろAシ\0ヌr^⁷∧g□ᵉ⁶,キeヤかfつd▒。,キク∧KS&ヌ8|ヌヨろとん□わこ☉ヌIまゅ■⌂웃;∧ユN‖わえG\r3、g░-タヨネ웃ろ⧗めIさ\"*さg□てむ8*ミ•웃`UIろ⧗]-0'\\ミfたをwせ⁵キて⬆️Vのク~▶웃、XろナWkZp\0ニわむ」みつ%ᵉxろ4E,たツのめmタqなね1\\すUはD▤-qユrッミ4へマヌdクn.vうM□,6⌂#みわJの8なサスソゃれ✽];∧チろつ*Aコねサyヌmアタ❎:メQB*ウ3ゆ\tアYルH웃8キ▶⬅️エ■-ˇ、ふ❎{「K∧らつ)b#\0♥~\t7⁙Rモ;ゃシ◀まU8ˇcあAチ^n⬆️⬅️$けへYsお6😐あテ▒りlニ(;うふねQわヒrモけ)っN2⁵リk❎♪$4웃&▒うAˇク☉ホr.ˇノあゃjY\tyseニ🅾️Rゃ2b□qツL@ヌ[アYけう^6nLナZ「➡️まJ웃⁸⌂sz웃t4∧ゃ6@⁴ね'キ□oす⬇️qN]uゅeさ🐱Kw•-あもふ!ま\"とD❎▒5B◀ミ^A⁸{1❎$☉D⬆️★Hの7□\t%ミヨdヌibウQ⁘\"\tヌHつ-⬇️い‖l➡️すね8に▮➡️rす➡️お…B8…◆2、KyDホエ。Tへqルニ,さD\\‖カ5G、Ic1¥…Aん□っ\tVuVHId「¥$け⁙\"ナヤゆ9…hヒ%☉ふjD\0;サX⁘⌂ˇ,(ᵉムコ\n░やN◀-ニ⁘そけ□⁸u、y:⌂ᶜしᶜ!^Ib\tᵇ■#★ろK◀X⬇️Sa%\n@わ8Aキ★inᵇしラセUN8∧ケ‖❎F❎▥く◀!⁸□J!P-▒ き■□⬅️\0★rウaし&★z%の▮…⬇️タ$AVNV!¥I▮T)⁘さr%ち★こQ¹わ…H\tdな□\0と-えせq%へと³J🐱□Tふyき…bEう⁷。.⬅️²,⁴⁘IZむJ★Y9dウに◀Kわキら2I⁵い웃ZOD■BけYA*ゃ□TC[qˇf▒ヌり■Vて8★∧[ヲ:$%BたPル[?•Dq gた1▶░ナAをウ⁸E\tTけ⁘サHそ∧ ☉GE8qy、.さE웃とY\0てホヲぬpJ♥1⁴ノ▒³\tl,●へキろpY□EDき█うむ★らヌケpaア⁘、▮あA$⬇️░Hヘ■8TさヌT∧ゃ%$ふ\"ょ/RけKB¥リカP⁸▮sJbったわサ!⁷たb✽⌂▮h🅾️□\0001□□+🐱😐@➡️\tシ\rイ-ナ░●⁸%\tᵉaるBそへ◀C\nノ⬇️r⁸²▒エ⁴¹、¹au♥)ノ⬅️ら▮p★Iら웃@ヌ▒ ░▮ケA⁴%+さ⁴D\t웃░「フキ\0オ…🐱PH★\t▮$♪⁴ヌゃ\"⁸a▮A⁸\"J9🐱⁸Zくb(、☉Z⁘*,,█,YRA⁴⁘(@⁴▮ぬBD%☉♥…オY□ ニeᶜ⁸R²り\tら\0P█²Bる▮ヌ゛Pく▒⁴▮`ぬAwᵉ,●⬇️☉(▤⁘!!`🐱⁸ ♥「\0Aᵉ█ら░🐱⁸x\tん、テあょ,はA⁴▮▤:🐱⁸~▮ぬ…█`A⁴$,.⁴$,▮🅾️!ぬs⁴>♥オ…A⁴(ナ。Aᵇ⁴?8q▒っᶜFもyる、るり⁴?Hq\0W゜♥ネエ<ほSn&ネ◝⁴:♥PcI,オAᵇ▒⁴▮ラ◀。ュヒGよ⬅️にx\0",
_img_knowledge_tree = "◝◝ヲ○◝◝♥ト▤\nすョ⁙qょハ◝ニハ.Fl+⬅️ろソpもょ.ヌJヒkイ⧗pヘチヨつわや[アヌsx★\tケ?レ⬇️⬅️f]mヘYまう%Jタおま9'\\yみヌiにrH✽🐱\t◀⧗◝\\⁶……idn8ヤ🅾️8Y][わ⁙あモ'6ネ☉ヌQ⁴ヒNSなbK⁷◜むqまsᵇ\\qエn7ᵉᵉkそむKエうメ、q❎★イ6◀#dD'◜け^\"ゃ'…とKaD🅾️,もせZワ/•q◀▥わキ^gQろ⬆️K3c◝+▤うBiea3웃ろ∧aQゅqアNほ;🅾️9へHホん2Pへセ*$;Oュテっ²ユほjB◜¥I'□Nbた2KとTあ^ᵉ¥☉Eネケ█?セ、みア⁶8∧ろウC⧗の\t。⬅️5ふ+N!:シさなrナ❎7+ル=♥▮K\\q:K-Bくケなᵇイ➡️%う░ゃLnヲなヘ▥ふ🐱Xヲ$$ヘとmゃょJ…ロ゛◜:;えˇ8◆]p\\ね⁘\"ホ\\1RUえ5ソノo~ワ9q9ね\"□hクJはI+◝⁸\"⌂ネゆヲやも=~s🅾️iわミ⬅️⁸ロO3$∧し}ウリ\tに⁷iエ⁷、*テ9⌂ほシ◜Aゃさ$q:9ホ4マNtュ$ヒsテうワエ⁸A}p★、²>⧗なJワi#お\\^DEうよラii8…ラリo⁙🐱ツV」ᵉふヌニ⁶ハcつれJねれ▒、2ムC◝$」/1#➡️ろ✽ナチK▮D✽ヌ^み🅾️、%トd★い▥をk▮サkᶜ웃゜て8✽\rウHコVERや░か!■エ>Kオあな웃▶み³☉w‖ᵉ%○GX=`FTうひむQに3ふけ\"CTVu⁴IᵉN◆ッG◜゜を'セ★ラち▥けフ∧を&8sfむV)■*○rひ>OュQ。モZわ★るやr🅾️8u⬇️と5Xユs∧ᵉ?◝た9ク🅾️さ░Dんm5…ヘチrた▶めjレオネ◝う?⁸○q⬅️웃ニ!i⧗ゅ⁘IxあKて?ス~♪ム?「H ニ#!キXニ⁶ヌv🅾️;ハな⁷3んホi◝@むDNdReあLu$ᵇx♪9ネs▮iょ웃⁘ハ4웃⁙そH}ᵉ]フr◜▮ね▮な*つめせ\t\"IるIg]k6^4のワf%F✽うゅˇめ_るWちフユ¹サチリ\r*⁘★}\"え--えsしラシ、すヘWᵉ8JᶜW゜♥R▒りャうリ…⁴%、wこ`YnI*ね!ん。rFコ⁴ソ.Y*さ]/!\0l░?つ!]んn}!をね□\"/<みキっキュBGR▤⬇️KるN゛\"g‖ろフK$9Nさ_ユ∧🅾️みuみrュb$えu⁸みPチみタ☉s>たg|ノ-ヒユと、p⌂ョ7‖ᶜ∧ハヲ,q⁙웃^Cテカ:ヤい■o⁴るけ█ふ4。4ヌsZシᵉ\\ヨmK8X*え⬅️yrSg_➡️ンっハ\n░➡️クiY$'つyや$はユツイエ{◆2q*わuをq)□I∧ルS◆ュシ ⬆️★チはお-░➡️`ヌ^T*⁸d。qわちXu」◀ゃ\"A\"7◜kアねうrマ\ttマ=ホjレᵇ8な!,⁴ᵇん&∧^!こなuネヘマ'★<➡️ム:ノサ8も▥$;█^みニ&ほN、¥pGい⬅️ネI□;•⬆️Hナ⧗お‖¥D♥ぬマ¥クiシ⁷Uれめ:…&♥⁷⁵#▥ヲレを…웃、∧テはあわt\0QU,?ヨみヤゆbXムIWs⁴たトみ:⧗'^3めoWゆe█➡️ウナgcさ◝わ3ヘIるCzI$ᵉ⁸#⬅️に、C\"L^g、Hq5!そエᶠ◜、T⧗dネ⬆️☉くすGjHひクおE+⁙qく'7∧Pヤ▶웃\"e⁷◜{$ˇ▶むネみ4\r⌂みN■9⬆️うホ🅾️ま웃ゅ4め❎<]さ웃,コあノのn■チ?「uxs4🐱タ-たd⧗ゆzク♪ヒミ⬆️うX▶▥□N!,うCなホ\"るHやBせオュリ☉❎いケ😐★dkタへゃ6うチのG▶⬅️ むタ[い9Dカょな*ちn|オうせン+な5ュ4\tᶜカ░⬆️■7⁙マ★Nに!ゅi⁴、ゃろI#웃Xヌワoミᶠメ¥くQふキB2みDG❎🅾️8⬅️こ□ᵉコ%リX★テ9/∧アˇノゅ○6□⌂qyもuろミ🐱\"けヨめ‖0a/⁷w^4qちカホャJオHˇgなPT3░クaさるN8チXIょいわしˇCっハ@キ?(Huめpョ%マKるテほ□ヘYイう☉]のヨウ、Uュ、⧗セfi#ま○²゜♥+▶⬆️マI;░ュ☉せ]u-⌂ミさのsS🅾️#うホて$▒ン$OョキるeN)キvZひNそ[8🅾️♪xム▶🅾️sめをEサヨ⁴むケメん…◜!ヤ⁸4!⁷#や-⧗ケ➡️6そオシモ$ky:チkアナN$♥マ~ラ?、▶∧▤チわフそ∧$モく$ふxチ∧Iをコエ²さはん²g◜(ZNくウヒオpHむ)9🅾️'S▒'ヨ:フMク웃lあヨV'|ヒH\0キめ♥◜⁸yろょキタ8EEウWお-n웃あg28⁷\nち!□Oヌ゜ンへネ]\"x🐱)ハ❎G]G\\イ:WヨをへょG⁸<Uᵉlフ🅾️wニ8○ミ░ホむフなd[4mエ\\:キY2*リ■dカ!⧗rヤそは웃wもᵇコラ>?▥。Hャモ8sw\\L⧗Iト⁶ヌ4⧗N⁙sキテx⁶•⧗🅾️w~u⧗な\\ᶠゅD♥ぬオたぬNV^aS▤!Tく\"p‖{u/5¥$いDZsわっq5⬅️l∧゜ヲにあG\"タ⁶ほYめをu'IX⧗♥⁘ラ⁴\r■⌂イん$ウ⁵お?ヨ★@]\tろ%k⁸のuほ◀Hふゃ1\rア,うAᶠ`リる⁸7の?x。dN$9☉ぬN6マNャへテ8ふ$qわほまU4➡️ニ8うUstKくWンv❎な$m⁴q「つろ★イい●Kん<]'⁶ ⬇️♥◀ヘA\r`る➡️ᶠマD●ˇ ♪ゅ²myぬ^さ∧E8えゃ⁸! タみ■1アBqᶠテTNノs$ホ□☉☉う8ヌとNヌる⁙🅾️bX▥「ソDq9タ^H$?「t|]フW🐱ゃ2Cˇヘの^V。¹w'7Iエ*ˇさとチ🅾️♪◀Lナへ8😐の■xˇ◜タ3~N⁷□さtdのq。kろ웃'ᶠんおyたみフいヲx★⧗웃qEUEナナ😐⁷◜~xウUx□MむbJ$ね\r/⁷⁷ᵇロKUサヒKZRᵉY、8▒lひ…'ョ⁴✽*ょり!ケ웃⬇️い$tまこ◆せY▒&ニmねコLオ⁴🅾️くム8ヌB,▮ヒH▒:░の、o/\td◆c8_.wをソ⁴\"テgtdRJ\t$cルや+お'|ヤFJI⬇️ちそに4マホん▮*⁸ネ8せ⁴クヨEムヌっセxᶠヨK◆き♥웃むほ웃tえ{をソゃチ\\\\∧!ヒひ゜▥ア◆ま'⁙ルˇ░ぬ$i04わ♪⁙ろもまへ⁴$む⁙きも$●CCれ❎おカノ🅾️x웃るケヘ□2Y□ᵉ!む🐱Lく;ぬ%マq★y9おリdい◆:あはあマueえ#♥$サユユ#•░‖を[イZEモq91nも♥。uQvなまヒ^-p$フ,∧X웃ハᵇ$ヌ゛I\\q8フKbxMアゃWNzキル*ヤ4⧗🅾️ンtつしソめテU。KCけ!ワ、p(ˇキGᵇ-あ\n🅾️sq{ホ◀ユのル!ろせ▶▥*@➡️せ59^⬆️ナD◝-ヒ🅾️ワ。Iレうフm8のに◀wオMエ∧¥っ#ん¥リイはW、ウ8ヒシGuR▶い◀Qhュ&ヒヌカ…クてっO%う~◀HヨんNオおん゜⌂Kf☉のI\\=る8「サI7eKs⬅️-ヌW⁸マ'4えょわ:しqf'T1a:♥1、;、モ:の\\}'\tシ|IWD⁵メ@、テ8j、nxそ^]p□$★^みあrノタつゃ2ヨまbヨ•N5ネウや\0b{4*:Eホん]コもr%🅾️8ミ.ネQ%もに□の7)]Lヌユ⧗みわチみ⧗%きム~¥ユのA□あ、っDヌsクのモ9な#ひ#$\"$いN4むさ8rリ✽Fシ⁸/□\t」Sよてマ5ね うtニ9ヘャつわ\r#웃アセレヤま░ヒに#ウ⁸シN$ろw¥:ネ-░ˇ☉えやいつiヲ*Wうt8ˇケコなヌl4ヒsまみg▮ᵇ•^og¹:しかせ‖イネ♥\\[v-ュ+⬅️イミゃメuま<░キヨみニ…タつエ⁙🅾️nにほ6✽M'゜♥>^$;I'゛Tネめkい\"n4も*♥、ayめᵉほ、い▥:いヨ➡️エハ.★⁘p웃お□W、•や▶🅾️mナNo3⁙^░ソCIろˇハ¥M「J◆ゅpニ4!チ➡️QゅDq/2_れなmはに:ヌ/、ヨを\"•☉ハ▤ホᵉまシ^dt⬅️ヲせpュヲへ⬇️の[さ➡️=IサヌpK■!コ웃こ\"うッq\tgね#レキけ◆オソY@U<チJワjミわをお9ZN。るD⬆️'ミスヌHョx★▮Cワ☉E웃'➡️t2れ🐱a3MᵉH❎░ヒてシヨ▥|%['ハ#¥ト゜エれ⬇️◆,のQ7Syえtkw}KエGは🅾️∧ツれ▥◀。7◜Cャ\"っ⌂7²わヌう⁙BBO$あB゜カヲH◝わ\t⬇️や」ᵉ⁸█な□キ、Bsイメ⁵ヒ゜ヲᶠュ0ナ□□わしヒ は☉★M9つ⁸モケマラ▮O◝∧、ケX‖、!tG□v★Eヒて웃う!웃 I\\Cユ♥オ…ルヌ⁷I\tゅ웃シ\"I%の]エ5\\ナ@^!。³CホV゛れラ🐱…o:M%ねろゅけ^\n…もレウ◆しqうsixニア\r0えJヌ゜ヲくソu1゜Nせ□っヒラも8ヌqみ★ヤ#Mろけゃせ²³◝░★*TTt★4∧&う#$:M\t=オ◀8カシ ,モゅカM-◆ョはDt☉ネカソモc✽なR8█^t~1\\uネゃしミせZ&Hiる<をみ_L◝ろうモヲしい\t\"ゅぬᶠ、G7い$ねアオ⁙✽テ85ラゃょや#ラ4◆a!!!ア|-おjむ⁸n8チtIク░たは⌂[gq⁸★メz◆!ャれヲネ🅾️y웃yハ[ゆヲFヨBqヒい;¥X>'た□rKお◀゜ッsさ□\"Wも\nˇひのg□wけソい⬅️れた⁙▥-ぬG?も?み\\メ∧▮BY\"さ\n⁙rフ#ho.キI&ˇエ2と[ゃさ|かネテxスIウネ\tサうC▥$◀~Mg➡️ん]&#ミさ░G0naてはン♥▮…Jtなl▥:sうHなxsmˇつおし#み/GJ^%せもタん∧⬆️へD♥ヌか\"m9kゅ~³⌂まほい,ミI#Dろ‖わヌ!ᵉさuせ\\bく⧗っ~ハ웃★\"!ア∧‖Hヒ5❎す6Kᵉ{Y■'2tふᵇテつAんオュaホわも²Q□て■Q9ね…チ■9ロ'|MdI▥x」118ふ?た゜えヌH♪R\"%あlぬフるヨ⬅️⁴ニん¥ヨノ^ハケみ◀つ]\\け、れュ●R♪⁴るい♪□8ネHか⁴はネH.★Y\"AU$もタaテq\\かン/rt{!9にsOわ+8su,スょケ:K?⁴No□ゆナ♥オ◝ネ\nKrYLらハ4✽^\nヒセd★?リCそH○ナへきIくク✽⬅️6オさネ‖⁶ゃ\\き~r8➡️ソ~……ヌ\n⧗いᵉ4フI1vi#そ5lらq⧗ハi#웃☉Tロ゜ンけDハヤ9サ웃#、ソ5い]&$ニヲJ‖8Hねわ🐱iᶠゃよリヨうっ➡️DたをヌXいi3まマホろか✽웃むね-★#け⧗ょ3ン➡️チ?(ddネ!xの8⁙エまチTしたRモW…&ナ🅾️yうp8のた&へ=ˇセンBるCゆせ、^6ii4rᶜ➡️dん、ま∧Tあq⁴Gvマq▤⧗Lぬヌ゜ャ.リq'²スiわヒアクN4セ⁴ネ^2タ8▥ろ◜く◝こIW∧あO8R⁸お²゛⌂⌂☉ネッ>➡️ュキヨアネ⬅️つ▥,.のるᶠdも⁘}\rRヨ)○レ/0ぬヒgu🐱H[、Qッ⁸や~\tu,。Hの9♥0ュ <♥へJ8ソハふIッちVヘい」もま✽➡️ア?ヨ9iるqる\rイOs♪たケ/¹♥◀りんZi8▥!Oマ゜◆⬆️さ웃キり‖lつ+;てね▶,ウまをあl🅾️▶Z∧◀⁵z\"Sにロをマ◀🅾️?i+●つd∧I?+%★Fナ░ナ∧!⁙⧗⬅️ち8∧I=コ`◆をWノかコ⧗□ツセ$H⌂∧Hしョaわ➡️k⬇️\"ソ➡️\tᵉaノ?ヨX⁙XTふ/5ろュモ4め$★なそらy\rウD○ハいかてヌ~ᵉ?-,うえ➡️のセ。う}ヤ}uンoゆリユミセソBCこユqンウVE░ニ=エoᶜ?ヤw{やツ|\0\0",
_img_knowledge_tree2 = "◝◝ヲ○◝◝♥トき*ᵉャT▥g=ん◝◝タおBり\t★タ)G◝ヲッチs\"Wᵉy^iz★rソ¥q○◝ろフひG9)\\v○◝♪ん{いアへG⁸?◝ミ■ウHq⁙◝◜ネ♥PハFもっ♥ン#ュ●●●✽●●♥フ%\"っヌ&ウ#웃R◀□□⁸q\t\tᶠヒ¥゛CCCウgsさ웃を…K\t◝◜y▶⬆️ヌ!mE★1ょ◝ヲrよヨ{ん}sソワ\"モけうr❎ゆさAッNかッく❎◝゜▶🅾️/⁸ハみYマ\t'★IンCン➡️ム?ヨBCちBラムwᵇろソAアた\n}ᵉくケ?そ○0ロしAᵉjろ☉えH…Cみ\\れっ~ぬぬヌ□゛れまN▥8ネ❎⁸うみuもサやヘ◝◜ケレ' くゅZリ%ᵉxM9_ょすde゜ッ$○ナ⬇️▥めフそフめつ8wエ•웃ミmサヌにおqフ;や▥チフか#お○)タ▤t○ぬタqruれqゅ8。ヤ$'◀H:はをう🐱さ⁙う\t+C◝⁴8✽●♥Wお4Zヒもいなx…➡️ほngうへ.ホbx□du⁸Yゃイきンゅ\"EュヒyᶠロまI▮ほBCお;ナは⬅️も\rャ★ヨフ:ンょ)フs?ヲリRせ²レ、qシ□∧q⁴qaッみrᶜハむへu+◝、?Yト⁴qWちOv⬆️웃ろエ`♥ハゅj○R>♥0Cイzそたかyんzチ▮♥◜Hゃ_😐▮マ◀。っオツD[る\tVGrロ,▥⁙ゃ_ヌᶠョ◀レソw]ロうホMxiアヤqらて⧗おまマレい웃7Q⁷⁵□8➡️ノ+◆を゜ト7rフ🐱まチt◆もナ∧ウねノう^ヲねアえワろい🅾️fW\nネるょる~⁙🐱iア웃ᶠ ●♥◀ヨるヨ⁙ユム⬅️に\tあND:Jラチトてやsれq79ト¥けン2Bムめ◝$メニ●ヤqヌq□HdCね:Nチsf✽フエ$フえ8お。♪ん゛よK;08<、@Nゃエ⁘フ웃Izヤ🅾️8ルW、iろˇ89K5ヒレゅ、Y▮P░웃$トささヤさネきpカる9pうIヲpヌ\\ンu▥zネ$❎ハは◆;ミえxYᵉ7うニるS🅾️jJ\\pュサNd^g4⁙❎\\C🅾️7‖Qア7🅾️86pュッqん<<ケマp⌂ョA;ᵉおnさ@$ˇᵉeH~🅾️て◆$⁙웃:^yᶠ}ヒ[❎おzもイ$9&⬆️⌂あ▤E'1♥◜「II\t。ヘ゜⬅️ゆウもヌ!○■%エむャるン)み\\け\n8◆:ᵉしソ◜…ヘ⧗お-な🐱▮⬇️⧗Hs<こ🐱uを♥ゆ:ネほ¥8ニjYPき➡️ょオ。9^9ネ웃]@キ□▶Yᵉeいれつアヒ^⁙Dニ,ノ;っ+😐えヒッ¥みハᶠろBい'68▮◀¥F@けh?²9HのコヌNbて²りの'⁙テPうっマツˇ◀ひ&'{ウ\\JrミやHねてゃ`:もウうsク4む>ミ▮p9z▶tCレチn、KX+し/。ル❎♥!ノ웃'=A▥⁷ᵇhやなのrソのq,をケュmけnこEqon▥7\rfᶠま\\mフ|コvヒ^UI☉ょ■xロ-sをマ4Oエたツくケ,ななッヲヌヨ9リウᵇノネ3み•🅾️ッHえYひら★$█E、N^ウZ\t\"カ▒て⧗つよᵇヌス🅾️WおzナヌフV9iz、んI]‖。ユフいイ☉♪bq。ᶠシ✽、ラへゃl‖'ぬネヨˇコヌBヨoニnチY#웃ア⁴サく、テ6ハ▶てリ,◆るミ;⬆️ナひく'?□」dもヨほうI⁘たりgᵉ.∧kコヒ⁴u8ヒ#なツん○9:Nvホ8め❎Zレpうuxナ웃ン\"Wナキリけま#●チ¥qアソヨらヒワヤ%のGヤテsow🅾️えモw🅾️:iへヤi\\ツま♪ムナ➡️ャリ◀ヘB、まタ⬅️Yん◀Dヤ▥さG|vミみzs{qKチシなみ∧□⁙●gシ、アつ4゜❎Dナp‖<:ネ▥ま&☉もほ-れお+き]|;hえウ/のさ⧗ユの'2ワ]''■7▶❎ᶜp‖アネヨヤ:ヌ³やbcヲ🐱まHLチ6ノqえrHラSタん;テみvXもサY\t\t9n◝。○ᵉなミゆOキW、コラ‖\t_すめ😐G9✽ヘ/|ゃみュ2⬆️⁘s。yに_n9❎Tす⬇️ルDu!Mᶠたくア⁙☉ケ]よ¥ヒT⧗▥ら8モユフts;░xW¹1、っ★B7‖dフゃん▶🐱HBンヒミMヒみ^、ウ☉❎モヤ゜なミゆ<モふMo<ヨテえタろ⧗Nま☉…⌂8T;}8ミqつ⬅️zャ⬆️お★せ\\テ:はをヤi●も□\n웃⁷フdいみヤ[ウ98お'⁙えアᵉ,eそョさ?4うリをハ▶ユ@ノᵉL■ in░む☉▒ヒうNDろヌew:フいろeJ`ュxn:=た9Cつx◆さsウ★ヨ¥スヌNNb}xハeへンろやO~めv5➡️ュ] ツエ。Ny…ュSよ•qろ∧Kさzク▤웃:ロMlくusシ3ト;:●うめ⬆️ほAエ⁷。wャJムq'|q웃fロvK:せ[ほ]h⧗♪:マゅtネ🅾️{ュzオ∧W□$イ$♥❎なむュd~|9ヒリゅ、Bソニもuすヘq、☉うテ'」~ぬ…へWみ{|ᶠ$uりケ\\るさハ\"qxニPI]mき▒\tᵉ&k,'|ミmハヤMzた)?🅾️ヲ❎み4H웃ッd🐱Cノdtも=ˇ。H❎uめ⁙😐はお[J…せワケうニNg$8ネ웃/ᵇSユほねめ➡️ん⁸ヌさうミ,★N!ュア…ネいuつU⧗웃Zn⧗み%q!せ、~2uクウ$マ^ほ•▥⁙◆dノホo<ニyハア♥フ+ユメろヒsa□まろ;#い⁙っや\"ほナマNヲな{zやヨ9チワト³s/<G2Q」わ⬇️ゃ_ほ🅾️]ヨ;Eてヌき웃「ナX、■\"ヘチなもあ7Rほ#ソ'⁙\\おっ◝ら⧗セテネ⬅️4⌂む▶웃シす🅾️サ@たᶠエテ9ホ れ★³◝V☉ネ⬅️みもえせY{ノヤbイた8ネ⬆️も:Hュミ◆$ねむゆょ:ろ'◜Y¥웃ム⁴ネよ゜ん□ルko~'[hO*ヨ(チ。□Wサろ•jH✽♥◜」²れトを^;★、wエᶠれqシ◀メ72,ュタIシ\\Fqᵇネと◀2Iイウゅ웃チろ4?ヨっニ○ᶠa8チ~9エ웃へモlョ;ゆYヤゆ:えみDフお.rミゆ8キケ*ヨ:~0ュきほ🐱fもxむ*I。に、I'NWZやuタモハヤ🅾️eフYれyろ\rᵇ\tゃさうCャコ□░⁷❎⬇️みトKくdネトxネをNyメみワつ∧^ヲュ\"$I。N¹G★?。|フˇワ🅾️gs◆るuゃとチヤ▒s▒'\rレほえてpひとん3に、1レな◝みニすヤ3ゆ+なzえqきタjフてN2ルqろ★⬅️#スvそこCゃᶠんセ¹dなすd-めいアも\t19あpul∧4や>ヒタVホ○」☉Xせ□⁴ワ⬅️yゆウ9フエ,うq◝♥웃サナYみ▮う{まもwアせ、ゃまョ'dメ4[ッqエ▶おHふサˇッホエ<き⧗♥Zタろ-ほtyんR{をょれ🅾️7□~:\n♪オpᵉx∧ニラGᶠ\"~えw;もネ🅾️7=pネ🅾️-★]んᵉ/M#な4も、/{☉ゆpニ$ク∧◆▶テ)⬇️おxキsャNうA⁸ヌ,CそKコMわゃろソもˇよ••░もN]^たタいgせ•と!」う-I.◝gᶠキrシ🅾️\tシ7웃'N`⁵Vるsょ\t7⁙🅾️ももリ8キWャᶠロ⁴d⧗えpマI/²I■<◆○⁘りるY◝お゜ゅ★⬇️に0ヤ♥は★ナヌ0◜❎ョ➡️◝♪x➡️$n•⬅️れk、J🅾️ᵇイコョほ◜)_⬆️9♥★8░フ웃zN$I⁸s.◜ふp★…J★:♥ョᶠんAよ□リさsわしロD⁷N?お9웃れフエ|:ハ#'JおBC◝²❎9□ょWな(シ⬆️ミ[ょ☉~゛G、ょコた◆,ヤ♥Rエe○ニ♥;めdそサsフ😐けAnう∧T░ヌ[ Mアqマ○ナˇ!ロ*tの:q3ホ\"☉゛◜もイ5○ホ▥ッれひタ웃あS[タu¹ア,クレヒリエ9f!ア<♥0◝クは⌂こhに\\qまねewアな8∧W0ュ!く◝★、[zpYyチq。フQm🅾️ハN◀KS▤~□?ユCCB#ちヤつx➡️zネ웃わyと•qょモ8うn79²¥D█ュニュれ⬅️:な'⁙▒|ニew)れとハワつハナ★@⁸○ク8♥ヤ:T9マゅぬもミむクおンレワ_^▤Dg<ヨふへゅいた8ク?h○8🅾️eᵉ$#➡️フ7k、^:モKろ★4∧Ng.ン웃fリ🅾️ヤrfュ!!◝'\\ マ8キみホ6モウ8ミセ:q%ミ?ᵇタ🅾️3░くe✽qzB\t★⁶ュくゅq);,Zぬうらノ★ア…ネ∧のHゃ8Mソミタ'+。ゃを■]ス웃モNx[6⁙♥wˇヤ❎⁸ヨムヒホ9へpヒ#⬅️サハ▮!トn8フた&チリ{せ]リ★qᵉ▶➡️うc'ハん、Nほ。NンヒN'「uy#Fな9ノヘZテTN゜8u7、ョツwワ⁙ヨムw□ょイ❎&▶^⧗웃りト³⁘Cルハケ♥ハo2[1○²q8チcっゃ^テ)まワ⬇️웃<モᶜu□'◜゛8チ゜⬆️ソテ#ロGcコ_る4は░★8ふ]xやユ:せ゜ヲwROy9★⁸えNR•⬅️エ⁙♥-uノy\t⧗ヌpう、Fン~やさアい•ッユケうi2てネウ8⁙□わメり|は♪ウうn}ハゃ:コりょA;⧗8•srQワ、き➡️みフ<Vム▒のに…ミウy⧗やdueツBs4⁙ノそ^5rネ[:はG/=む~⁙⬅️ᶠ•アF'ZV⧗いxsるヨ:フモャフふマニ⧗ウタ■シ;⬅️g.。レん\\M🐱%え?i゜ˇGはqケネおよホヤ•ゆ ネ•お\\Y$うMわDミ😐9マuc⧗すョd~あスリみっ゜~、wzチイ.さぬュ1'³●➡️◝∧゜▤チqた]ノほ🅾️6p♪イニ□ラネs9q⧗シチqれ♥{p○ノ?dqうモgKふ,うKウサに⁙^cめᶠれ웃ケモ⁙お、れ◝⁴ニュコしqアキせlウ◀きヌヨコンんソK.ヒ、ミI#リ░♥ネ⁴'¹。^;う!}マョんRふチoˇᵉネユフ♥³いっ8▥ャM\\█^\"[ん\\ゃgフチMサキ^xテイシ<♪.♥ニo¹◝<NヲᵉyqゃはいSsノ□:ャqフYpヨケく\ny<IうoにT○wお!*ろはケへゅt~\\テ9ツx●ˇ\"け🅾️ニチ;ホウおk!Wた▥?웃ᵉN9♥\rSヨ•ツん?yコk\\かwゃUテるゃウうせNいt…ヒt◜ちIU「^なnてッて=Cみん¹ト]u:やンˇyカけ⁙(░フとせ゛S◝」ン8tロi'u<%웃ウむ*てねみモ?クヲ♥ニᵉ${\tに=³Dはゆなタたゅ&めあFjん◝ワ、まほq■タ🅾️9ミg⧗♪りqさs8ク⌂◜g/ラ゜も◆ゅ⁙∧8➡️\\ち'?ん□さqもモ:D◆et○Pッ¥゜てW➡️eへウ⁙ユdセ\\なもHゅか░◆!ョBCル░░ホ웃むB゜ヲヲ8ふろ★さ?「q\tᶠョホyヤqゅしᶠュチゃイふiルニ◝サゅHhナホひヨ+よをWユなxチワlむま?ラLモ□□ᶠネウンはゆ{シさュ7⬅️;゜J◝fウo[;J]゜ム웃ᶠヌqRミろチn□ろqe~キ?r゜ひ,?☉~N$レ❎ラ➡️dyᵉa◝★゜ンaン'◝hH○ニカ\r■◝Bれ◝,>♥◜エほ>ワン~^ヤ>フたキれそ⁙ユ░♥Pョ!◝な、ョト\\ツヤお~~`\0",
_img_dark_and_light2 = "◝◝ヲ○◝◝♥ト▤\n➡️へよコすO○◝◝◝ッJ◀□□、C▤h○ヘ✽♥ワᵉ!ンCワ♥▮ヒ、BBBBBBBCユ🐱□□□。Cそ○◝◝ヲも?◝かᶠヌ゜ル8░♥ホᵉくヲるるC▤ ♥ヤᶠる゜Cレ░░🐱。C▤HH~0ョ!a!ノ$8♥◝◝セれン♥ンᶠ◜オ◝エᶠサ□◀゛Cヲ♥ヤ\rᵉく!ンれ▤hH○P…モ□□◀゜ュく!aョC◝ケ$$?ッCロ✽░✽♥◝っsᶠョ0ュ!ケ?「○ル♥▮…ョ!ア8🐱⁸~ユA\r\t\rᵉ!◝ゆ□⁸!ア?まwᶠヌ¥。BCそ○レ♥の$⬅️\tᶠョ0ョa◝お、れA#◝、웃ᶠョオぬ………ロ。Cョ➡️ろ$□:♥◝ユ`🐱、っマ、っぬHマGレ⁴▮…ヌ゜ョさu#▤X○オヒ゜う>✽♥0ロ゜Hュさ~P…ュ!さ○ヤ➡️ろ▮Cた゜░◆くa!チ░░9➡️ャっヌ゜ッ$~ユオオモ□Gャᵇᶠ◜R:➡️ア$♪#Hキ▮ュノHs!ᵉニンBBC☉q\tᶠゅ゜う?▤$○□?ラC☉~ユッ□、り\"Hr⁷ホᶠソ□゜ャ!!ろ▮ヌ¥゜も◆さ○ュ➡️ッっヌ⁸L□\t⁙@➡️!ケ░:🐱D➡️d~ラ$8░➡️チ◆!さs\r#ラ♥▮◝$u+た_░?⁸h%s\r\rき★'p■ア⬅️⁴▮H◜$○ン➡️ノ🅾️$I゛`ぬュ`➡️◝ッG0マ⁸M■サ!きキ.▒#ラ➡️◜るれ▤h ✽🐱。C웃◀ᵉ ⬇️え■くチ□?H~Pロ、れレ🐱▶■dPnB8オY\t。るるAᶠ◜の4🅾️aく4C▤#🅾️H⬅️⬇️웃¥E♥ハᶠュ28🐱、Bり\t\"っオネ…8りy🐱,◆ッ¥、るBHヒ➡️d😐³ユろ1⁙▤#🅾️b2ミ`q\"り\"っ◝ニ²m$🅾️★@⬇️🐱\n▒\"く:☉웃⬆️ニ8ヌモg¥*pんRさ░?H~4さ⌂ち…░;➡️,RH,H░p🅾️:ワお8❎$♪\"Q◝∧Eぬ웃ゅ)りJヨdD*■\n☉⬇️PB'⁙ラ▤サさ♥メᶠサ、¹bモ•▥⁶DHのDD'■ bG_なネBW▮ュ!ル?■rツ#D☉、、hひうカ\tᵇ■$8□sよ♪わね1\t\t⁴?(qᵉl!を4の…Aくあ■⁶ヌY`*◝うq!◝ろX☉✽m$せCつQ\t「★%☉へq◜3と¹%u#ン⬇️☉웃,\r²えpn(✽\"…☉●)Aエョxウ-4なaョヌ#…ˇg3*q/⁙,∧IDH★ろ◝りろ…QくョC😐Eね⁸とeカゅ&█ょ⬆️うk&の\t◝●ラか⬆️◆ウ、Bヌ)e♪y⁙の•8。⁵bっk&◝ゃ`🐱¥¥゛Cゃ▶░AHd웃JtLhのUbᶠュノ<♥…ュa8░\t*DYTノyFQn:⬅️ちゃ_ヲフ■そ…マ゜わ#)4*\ruおhpも$ソ\"▶░ヌ?リあ゜ンヘPぬ&?■ハな\nX し◝ゃ%★\t!!ンるるH\"く`dカこ☉♥ち&★Zヌケ☉○ハ☉□=░♥ミ!⁴◀%🐱ヘロB웃$X🐱\0C◝$ね\t\t\tᶠヤ³☉★⁴⬆️」eや▤¹るKX◆ョ♥◜{\rAた-ん⁵:8⌂ヒカうEˇ-◝ょ◀JAᵉaル$\0K\\[\"オカノ⬅️っ(ネZ⁙ˇ ◝ハ+そqᵉサこHの$Hけp¹ BJJけpひ◝ゃ⁴░▮さ♥リ□rちMRタ$웃🐱⁶⁵[わそ⁸A◝웃んキ?ホ\tつal,…⬇️い9A %웃!⁸そ'◜9★⁸!aaンBT-Uね!¥obp&8く5\\オへBれ◝ᵇ★○ノ♥Xそ\0³oま웃⁙なノd\"m#I■Rそ★○ナweHXhXsᶠわトユˇ‖cユンシ■J<H⌂○ナ➡️ろ⬅️\rᶠ◜R0⬅️'v=▤たUん\n⧗ュな□W◜☉○D🐱ᵇuK、Z,。➡️ᵉ⁙♥ヲリっh○ヒ🐱、A\rIh@L\t■7゛$かクX!ア9░♥オモ。CまQfあろオy▮⁷Qょmッし<♥▮ュ!!ケ?ち\n、ね\tVろハ¥らノハ44o9ネ🅾️8へゅR○ノ♥メ\t⁸カ%きキ⁴ノ\"D♥\t)しわイ'◝っXu⁴█j$8Dwᵇセ▮○▮マ⁸X○ニ♥▮ヌ◀\n⁸N!さ$ ろuきBれ☉s⁴?⁸~0◝くP★BDFᶠをᶜ◀□、Cそ○ぬぬヒ⁸~▮ヌ█➡️ア🅾️き⬇️⁷pぬヌ、れヘH○リ✽➡️dHL⁸{ス⁴●♥pロ゜ヲくチ$9✽░♥ミ⁶ᶠa!ム:🐱゛れユ♥ネᶠaンAス²。A⁴;🐱⁸wᶠュ▮◝くンCリ░♥pAᶠゅ゜BCスwᵉ!ュBCス ♥PCロ░♥p◝イᵉナ♥pロ⁸}ᵉナ🐱□ᶜ゜░?8~0ュ!ル=♥PBBるC◝L,$?ユCヘuᶠ!ンれヘy\t\tᶠュpラ゜░:✽✽♥…ぬマ⁸!く!ンCヲ♥…Cユ♥ン⁴?「○ミ♥◜ま○オモ◀⁸}ᵇᵉ ♥ホᶠュぬュ!ケ$<♥ハ\tᶠaノ4<♥…ぬラ゜も▮ロ⁸qᵉくム?x~オッ□゛るれロ♥フᶠる¥。れヘH○ヘ♥ヨ⁴?8u\tᶠき♥◜☉~…ュ!ア>🐱□、C◝⁘4?ヘu:}\"CCユ♥◜(Hyᵇᵉaaケ▮モ\t゜ンノ~…ヒ□゜う?ス○ニ♥ホ⁴?⁸Xsᶠキ⁸~0◝クᶠウ◀゜Aᶠラ□゜さ:♥ミᶠキ゜ル?ユCワ♥◜「h~オC◝⁘44▮ロ。Cス~…ュ!ム<♥Pュ!ム>♥Pロ゜う?8sᶠヌ゜⬆️9♥フᶠソ゛Cン➡️ケ◆ウ◀。A⁴?っwᶠョオョ!ケ?⁸○Pヒ。CそHsᶠくaaョれラ♥ホᵇᵉaチ:♥ぬオ◝ャᶠウ゜◝シ●♥フᶠる□゜さ:♥Pロ゜チ<♥▮ヌF➡️!ル?(qᶠキ、るCヲ♥…Cロ♥…◝くチ:♥ヨᵇᵉ!ノ?レれヨ♥ワᶠ!ム?ワC◝ᶜ▮ョニa◝を゜⬆️▮ュさI。Cヨ░♥▮ョaア$?ッり⁴;ˇ◝Hョくャれロ●░♥◜☉qᶠッ゛れス}ᶠくヲJ◝dhh~…Cュ♥▮ッ゜ひ◆ソG▮ョ ♥▮◝`♥◜ゃ。H…◝タᶠを⁸H○ヘ♥2?み、C◝\\?⁸○ぬラ゜ノ?HHHwᵉき♥◜⁸{ᶠュ…◜!ル$:♥ン\t⁴4?「~▮マ゜⬆️8♥ンᶠく ●♥◜X~PラF➡️ろ?ャC◝l:♥…◝ ✽ˇさwᶠュpュ!◝マ゜ケ;♥ハ⁴?(uᵇ*っュ!ンC▤○0モ゜エ1⁘ˇ◝⌂Wミ\tᵉさ}+J…ョ`░ˇシテyヲqヤ゜◆ツ◜<◝ナ9えめ♥シひロ◆ソGワヤ=wエニトゆ~X\0",
_img_connectivity_insights = "◝◝ヲ○◝◝♥トき\t.はッWL゛_◝◝ろり⁴▮A⁴▮A⁴▮A⁴▮A⁴▮A⁴▮A⁴▮A⁴▮A⁴▮A⁴▮Aᶠ◝◝웃🐱ᶜ⁸ 🐱⁸ 🐱⁸ 🐱⁸ 🐱⁸9¹▒⁴▮A⁴▮A⁴▮v\0ム¹ᶠケ□゜ス<⁷ムᶠユ゜ろ「、▒a○き\0\0,、▒`🐱⁸9²りョ\0\0¹きら░りら<✽♥ワ\n\rᶠテ゜ヲ!ル9●らり!`🐱⁸ 🐱⁸XXoっ\0⁴7  🐱⁸!!き⬇️⁶り`⁷R$?セ◀⁙⁷ミ⬇️ン░りモᶠるB⁸sけ▮A⁴▮h,=🐱⁸ りろ、█ム\0ᵉy¹ᵉきノ#ツ⁷ャ\"リ\0♥ミ⁴<⁷う▒ム「=ノ⁴4웃!っᶜᵉB$◆d=█!#た\t\t◀D…➡️ア░●☉ッ⁸t⁴⬅️\"³ヲ🐱B゜ひ¥#ゃ□G0HッBB◀D🐱◀◀E➡️ ろ$!$!ノ「□□「;🐱⁸w⬇️て□゛れっXY◀Gネᵉ1\t「゜⬆️▮ッ⁸u⁴8░⬇️⁷=█$Xi¥ᵉっ🐱っHミ⁵🐱ᶜ⁸s⁷`、Aᵉき░♥PB ぬ…ま░░▮モ、りきヌ゜◆ ~□:ヒ³▥◀B、Hま8オY。っb,░<りd4\t゛h▮★'0。HCHヌG▮フ■dnヌ Hキ*(HC▥゛ヘ□<♥ぬHラ▶■さX!ひ⁙■ケ웃ᵇ☉メ‖\t•ま³も\t、っAᵉ$$!くヒ☉HpD□E…ナI!$qチ¹チ/□ろ…Aᵉき♥ぬロ、Aᵉd@k■EEほ8ひ:Q゛s■◀⁶$こま!ウ⁶ᵇ⁴「&ᵉヲ ░らn4B^(🐱オ]C🐱、Bり8i⁸$q⬇️…H}\r!\"∧D➡️➡️ゅ!5🅾️l@◀\t]\t□Dくツらw⬇️☉!さO`³C▤XJ「●░Pあモyp♪⁴●▒\"X0웃'pC▥\t▮pᶠゅ、AᵇBる☉ニ★\n★ 8gD#³i8ニとも■そCう■4;ら……░…➡️ソn□\rりコっ■#♪オˇ⁙TO IイM▤:ら⁴…➡️ろ□:Oょ▤ᵇ☉テ◀t❎n$の]⁸サろ●➡️Qウ➡️⁸⁷$¥◀G¥ᵉ`🐱ᶜ\t\t⁸v■り⁶せDそR&-▶めHち▥■さ◀ホ、ツaアさ‖¥²っH◜\0🐱■)mMそ¹り□i◀っD∧❎…⌂n⬅️%9✽り! ね7ニ\0²CA!トノAd▒`けIᵉサこ!‖⁶★.JさノYに2²っぬヒ゜ケ,さ🐱UIろ@ら➡️e%'0…➡️VIzD⁘♪lヒ8∧duD♪⁴$▮JHHHC⬅️ᵉ=ツサ☉6➡️IのB.V➡️'オHTR-さG@░ヌwᵇᶠaッナオうケフ\"9i&2\"☉⧗●😐ュlへk■\"タ◀ヨ'■!✽⬇️²□▶オ²ゅHHH`オオN4c♥▶I⬆️웃b¥hサJふm☉イ#⌂∧P$H、q\"H…ュ$~★40□オi◀Xき$ニHサLるi{★サつRんu。さこ█y)!⁴8ら⬇️⁶➡️ま⬇️🐱U)ᶜ_⁴▤⬆️むN+🅾️:フお∧Lた•いᵉまY!く、さ⬇️T⁸u⁴:⁴ろM⁶ヌ^a$∧っsW⌂フ⬆️iヲq4!★k-み%ᶜ¹r⁷3🅾️89…ノ)ᵉy█ぬッᵇん□N!D★]□⁵ニ◀ g=rとろ'タ^3doo2%⁸て⁸vも`モ、A⁴+░オチqツこ🐱Dと\"むM%ホyヒ:4うNまRせ▮4EqさN@Aᵉ`🐱▶Tyり く⁶N#KろチY■b#♥³X⁘[んbさハイ^,rネP%Y゜░▮ラ@キ「8Wうˇ!\t8なフ¹N$ᵇ▮なな*ょわニしナュルたdメR4⬅️!け□,'`G□<…リ^□⁸れ⌂けめなdPI⁸うん⁷Eノv🅾️すI{sしTヌ⌂➡️モ🐱Cア⁙…□/ナフあやhもAx▤B $⁴p⧗#█ˇゅNマヨの²ね1∧★B⁸{!!ᶠタつxむフいはも➡️、ホ\rmほたれ🅾️くlニこ'ヌEl∧sら웃5Y%w⁶⁴に$ 🐱⁸1OIxミ웃ちi9ケ¥Aワᵉ\\Dケ웃-…ア❎ˇぬhホら★^Dセ8NC⁸9i⁶ᶠら▶$Oん●웃Kふ□s^7、とノう@キJハw□□~Qわ➡️•\\かiょpイ⁵]⁴ろ◆=\0🐱(えユねれ-rョモみeヤ🅾️mゃケ76i、ス◆るC.は◀Q」れ░HNeミ웃□あ¹シ`゜と\"➡️エ□ef'SさHワ★Hてフ♥²^⬆️IたoニmウyutqひけM\tウ)きモBBBC⁵めrヒDG\\uしD웃\\pい,うLっい⬅️:ょ\rヤ<ワウチマU²しゃ\tvら⁷pCロ🐱H🅾️Nまヒヨ9ˇx♥♥、qセ⧗ち.ネᵉ7mろリ¥ウ-y76N/S😐ネ웃ろに 🐱、Hh▮`Bフ¥と⌂ホ ➡️れユのタひチヨV🅾️xへヘᵇる2りアミ웃ク░pいおあ⁷ゅ*ᶠ0▶レ…キsc▥たろ❎●♪g□t⬅️⁶r\t1⁴ノはい/■%X$⬅️ち,➡️■⁙🅾️っᵉ ⬇️ユ\0#]3Ysユう#kd;ラWvGハてIiし+▤🅾️I9チヨ2そかiアフ▤ちしの□;🐱Gヨ웃アうmイ🅾️5な'◀n#をYわネ⬆️r⧗⬇️'、GMをへᵉハハをセxソY Bれま!シ %$$I◀NZN2H◆xWろわへろ…F⬇️d☉'⁷•⬅️つYc🅾️AヲるXPr²、A⬇️リ●pヘょメYメ🅾️Sしヌヨひqん⁙⧗ヨク☉まsりb/▮%ネ웃zヒリ$にbコXヨ³⁷R¥!きBりをqコY9jヌ、,W•⬆️ろ2わM。pチi/たん\tるス⌂\\ᵇ」8<ZD8⬆️q⁴?XY8\"リん■り゜ˇこえ{ヌ➡️ノタお+🅾️、ゃテヒ@⧗Hノ▮★⁸🐱r*13‖ケさウ$! ノ\rっ^◀Sっロuxゆゆn⁙😐s➡️⌂ルもY6ハiT\"@め⬅️k')わNはタ★\nひM■ろ◆0K0OdニIa/iろふ#:🅾️|…け9ユˇる~2eヤDY⁘たわ ⬇️%▮ぬ▤&⁴なッネ▥めコPへシえタlフヘやuっか✽★みs9ネ⬆️☉ウ¹i,Jなち⬆️pWナDB8s0)}▮A⁷うヨ'⁙@+qヤひニれ⬅️テN⁙テ7ᶠnネGふsこsqオ'け‖1Q;nxて★kルtフウ□へ)!#タtmxサlフメ'\nヌ~え8udほ\n^'▮*SD◆エu$➡️'けむた|オ웃•Yb➡️セ\0:⬇️⁘ュこな/⁶sう8ヌフウヒ、ユnkHっ8pˇりろ\tそひウM¥N#めSウて∧てク@∧sG0Cこn9ハ%そンわか[\\<ヌリウやkG5とゅや#\tモヌ'、K、y.タえセlュ\rょFむ&⁸カS□☉G@▮vG⁶BもI#IレEF2ほIりま*モ%ナk.マMdZGi‖⌂、cお\\ろ★\"せ0FJョ%ち▥ろツ8UハンᵇんR^zY#▥.NbBZT、T➡️⁘\"dモOo゜L░dI:<っ³…。█8トN)ネな>Y,/、ヤみ😐ミナ:う^8みん、ホるむ🐱%ネ🅾️9🅾️\\8ヤちレ8ら░K\\イ◀-ソ'ンシい🅾️e∧レとむCˇマケフ6ニク^fuVイN❎q◀∧む9てWI>ネ★ˇN」`,ᵉ⁴く⁶⁴さ□□、D✽りKけ9▥71うホpシうMW🅾️み^4…^t⧗☉\n♪#F⁸✽うる*ゃcあよワシ◆c🅾️よ⁷Vセ9AuOラcnへUqまウはつ「アはqさささ…!」けB⬆️웃、~¹Q▮⬇️…▮[むuひラu/<Mわ♥|□^□シ:しくk!4XTへ\"^゛*Hˇl8ᵇ$⬅️⁶ᵉᶠハmネ:サz^Tイゆゃひチ■イネ⬆️ょる➡️ろ]るq□゛T★と○■,,のN:ヌタ▮ス▮Bv\0らこ🅾️|ュ7S@き:えk8?,めhマさ♥\tN:⬅️。I⧗Uはえエ=(カ,DもぬM■くろ;⁷⁙ヘヤUロ[xゃウ^,∧q⧗tワなfn9ツろJI¥…🅾️ZQ★,ᵉ■4く2YひEろH9²っu▶そつケN%Oりc∧▥ゅdrサょに⁵ᵇw\teマ…^み🅾️WKUrあZヌ!「44(8➡️ん、レま⧗:▮d♥⁶か8tpチsわn8G'▮N+5ナ⁷…もYR*UG□けp\rけ「&\"A#Bリわホ◀-ハ\\tうウャもク❎•やシ-シTもSたケD⁙ヨね、タるsHノ✽Y, 、\0uᶠくそ]o\nネか□。$ニxrYサIわ:🅾️8🐱ヘ웃}⬅️,のPク⌂q⁴お*¹,きw⁴D…オ!aまヌs、4IキテンあメU8MnさキUホg5▮、NぬC4[E★\"⁷²$🅾️ノyき…う%qヨ<ソオわu:な■(」ろT…うUウ4J∧たt@コ¥⁙ぬᵇス⁶░ノもl?ᵉxqy♪…し^な(^ニ\\u.サ~ね`eさ$⬆️%さI\t0(³CっhNヤi,{ょふくnキVBZ⬅️けx★░え$リえ゛\t/\r,IH▮B⁙TO@\t#▥み\n❎めれ⬇️HてクM$ヒまˇわ★Bヘ웃#▥o3▥aw‖‖bしp)\"っ□Gキ'p。せ⁙●やt-KZウ,^)z#🅾️,⬇️`っカ¥■⁴A.➡️⁷□!☉あ⁷ナ\0Gのiろみ‖ᶠ みᵉsセrタ⧗\r+😐…のN▮のカˇる\\Uキ⁘な◀っヒ@オ⁸ᶠぬ!.コ*ワれ⬆️NV+つjdゃるpうN.⬆️へ³ᶜヌシ>し@;…█p⁴▮xそ☉Cゆ\nナヌOちほ¹w⁘Jヌ¹、K³_gᵉ?¥▮⁸Ikp♥🐱$…‖T$⁸□▮HマD⬇️⁵もAラ4ヌわヒ;8n'¥4は░▶█ニS✽F✽モ#pウ&☉%⁴RN4✽ノ¹y²る²HうF♥|p∧Xヌqさス7」➡️し░➡️るᵇっTi\"Rょき⁴Nメ… ナ²ヌ$⬅️ᵇ%Ntホ5pYR✽ヌ▶Iˇg‖RN( 7□q☉A!をオ.b▮Z■¹、³BC@イ⬆️⁸*ゅ。⬅️\"pウひあ`るっISV•3²ひ¹る■█%I⁸]■!0U5ネ3⌂I$ねHC、+⌂マYe◀ン9…そS $#♪¹す!GB⁴¥けオそもAり□Kひ⁶▥'Vいい+▒゛ら、サ\"ヨ\"eD░ク³웃⬅️E A⁵░オaG(g[²とiZろsM\"わ-サ\n□ちあ%`²あ%WJ█)➡️!(ᶜG0Xふ\\ホ▮♪\"っ:-★qjゃ2웃エ\t*ラ➡️8ネひキLh▥d★¹@█B\n/ QI~へpゃ▶☉…HIF[ヲN⁶ニろたわい-★(うa■⁸6D\rP░く⁵G:ᶜ★R!^ユキ ⬇️あ★$♥\0fゃ🅾️□ろ⁵BR さ∧\t⁸ウ▤¹⁵0HHu¹⁴…っ◆をKけ$⁙⬆️⌂▥dq-⬅️B(P⬆️、け#☉Iアˇ□+たP⁴$-⁸\n🐱るB%Wハe□る□Rっネ▤+🅾️In➡️\\て!d웃■R⬆️\0キ¹*X2 Hあ⁶\tᵇb!T[!ツ…ˇDねi<の d•そD4Hヌ!Q█BP□て웃@Bるh♥◀スつテ웃‖,ンBZ¹⁙っそ🐱@\\▮ˇf,と\"カ\rBけCこし⁘⬇️$はた◀%ラろ(ム■$░%…ヌ²セ)dLそオ4G、■²Bりら▮(⁸さヌ⁴☉ヌろなとふ◀▮⁸ᵇ!ン⁘%▒ˇ*■B웃*リ\0²▒く`ヒ²⁵ き²ゅうJふ)ろ☉I」!ろD…Bオ P∧⁴●\t\n*$⬅️っ□、H+█て⌂ᵇ*H$⁴\t¹$⬇️み▶█*ゅ[*マ▮ぬ▤□$●\"\n웃っᵉ)PI¹\0pURスの!¥\tさK⁶\r⌂そのあᵇ\t\t\r\t⁴²░◀ も@Z☉)\n」lAホeDI¹P'`$ヘH░⬇️@%□⁸N²ち▮HHA#BゅHᵇe$ねJキこ░★っに² けH▤░□E、`Qa ˇノ░4□&🐱ᶜBP\"JBとK■i⁴Z⁴Wっ■!H⬇️*\0へB1□G>■\0N\0★I◀◀C☉E⬆️■⁸'UU*めBBQのHのG⁸の%オ(⁸Njᶠq▮◀D░✽🐱Cそ✽,\nUBRコ⬆️`XそᵇDっうけ█ˇ$sユ\0\n、\"⁘B@$⬅️◀qJXもᵉオ⁷⁵D「-Hハ$@さ☉★(Jのさ▮ュ$hY、R\rbっ$$$E,ヒJ➡️)bふD<ちヌ⁘BPき ░ュ*\"\"&\tC…Aそ▮🐱わ。e♥るち■カ\t⁘█\0(□‖VC⁷□?\t¹E█⁙⁷□4⌂そ░H⁴う□⁘*F!Gち□、□◀³😐F…ム¹⁴「▮h🅾️1\r⁘U$、◀[キ*せるり▮~Q▮AEノᵉ!aケ4そJ.⬇️ゅ⌂░★\0チ*へ⁵J¹R⌂²さふ\tᶜ、HHぬも▒<☉²E➡️きムそたb\n░\0\0しsj\"。I%²わ\n⁵ヒけ8➡️0q#さ⁙³█ᵉQP、ち□」」$Pヒ@ロHD‖VEろuき…ス⬅️ケ¹➡️²⁘⁙■R\r⁸⁘▮\t\"キ8!ツ\0*¥⁶#웃⁸q\tᵉaゅ\"⁵ᶜ\"こ☉i■◀HT█P、さ🐱$P◀A ⬆️…!y³😐◀Dろ^@け⬅️ᶜ⁶⁶☉ぬきR◀Dサ✽(ˇN\0D➡️⁴.+え⁷▮ラ、マ░「、D⁷□.!け◀!⁸ぬ(、\r(ノAっ⁸1▮s¹y²r²ᵉBひ☉⁴🅾️$HhY◀⁴¹²¹ニ,⁵⁘A⁷@9♥R9Aん (H∧⁸웃$…➡️!a し⌂^▮\0Dす▒➡️¹■!\0ノ\t!!\"っBrDs⁴웃ヲ_;ュみュフチレ0😐う「ノけG2ᶜ9オ……⬆️$[⁴²D➡️ア◆dqᵉ:\0,、ャん゜❎ゆせpC",
_img_magi_ritual = "◝◝ヲ○◝◝♥トき\nヒい□Dコワむ⌂(っ❎,2へ³ᵉまナネ▥Zn⁴う9⬅️エ。vネ🅾️h▒▮Trチ~、u)‖rD∧T⬆️^;qくセ⁙まD'\0004うwオ▮ヨ'aんˇヒ、みNz\tう웃りまニわ⬅️(kろr²\rすGフツミなャス▮ナヌ:ん\0:⬆️⬇️✽◀BV「●ハ Zg■ろフqアす✽ぬw6H∧ᵇˇワᶠ。:ニてぬ★セh⬆️p²Gヌpᶠ7S⌂★◀▥ᵉ8チノXLけ9∧Fね⬅️6ゅハモN⁙X@☉らち8オ;\0ヌ•eNn∧pょうgldう■シ<%ねh▒u▮☉もユ+かよᶠv9ミ♪シ▮➡️N9♥u]ル³フな8ハわdのrモqる!d$つA▮¹\\ょシ]nx|おGニ○ᵇヲnほ✽>コ\n🐱🅾️★-!フ¥っ9g;いほ$ノニるq▒¹`'¹PJた}リ❎6ル|゛qR%웃☉さ$⁙8ヒオ³らく'\t⁸¥A⁙\"ᶜ、…Qゃケ⁙★★^8▒&ᵉ,のFぬtIᶜへれイ,)8こた¥⬆️¹ヒ⁷ 9⁘∧hvニgニ◀u\tr😐0さsキTヤ☉웃く8ナ$し█へ⌂「;&⁵‖EY;8おセヘp20A⁘▥'²ゆ⬇️☉⁙ラs;ょ$ュt★X░せ¹@オB▒@`シ,モ8ˇむIわ\n、ヌJ9シ░ラ□わ%そキ\"b%て█゜@u▒FチYᵉ'■わ🅾️xl♪$…*YzスDヲ9✽wJえJヌ‖…⬆️q⬇️☉(ヤ‖:キゃ○²も/゜^8ニく\\Pう;∧ハjわU&🐱をス「,⁸Iqわ、C⁸j⁷<ワまほ◀Wニ。n7□j⌂.タZぬぬ♥dN*)⁙⁙😐□゜😐⁘J⁙█TV4も◜Iもの.ゃ1 !7Vゃ)@ヲ🅾️*Kjヨ³+█X~e█]ち∧ミ!ヨん|∧ろLNᶜL➡️PN(8⁴のJ:よあD◀⁶\0~オ🐱⌂ゅ★Aメチシ□_ᶠ7mわナt⬆️Hヒ['ヒは\n❎D☉ \0ニらぬラ□□²vX0うユ-~キs;ミ⬅️マ^ᵉまぬ@-';8Hきオ‖IけRBG□\n?そ!みそdえ…くろ[るq、i!\"LわX⬅️イDr░▒ろ.\\s I❎…$▮マ◀²bわオRょ0つxた3⌂ほ&웃れるソᵉ¹カ$とPり8」を⁴9♥Pr\0+のふヌすし🐱\tt★\"⁴;1ン@Ik▤CP▶ˇF♥ネᵉ\rFハし∧Eう2ケ▮-▮キ▮★$▮ぬp⁴' !ヘEぬ🐱⁸yら!わさヌI▮…b★FHョ🐱a⁴9□ Aマき█モ゜□□)⁴vうEみlˇf\0ニ$Y゛ᵉA⁵█ヌH☉9り□%リ\0u¹6웃Uエ\0i*%。ア█h▒ もユ░む♪⁴'⁵█9²bナ☉wᵉきddJの\t\"ゃ。∧i(サ★オX8□▮ᵇ Hᵇわ▥⁷²2$`Iナ¹ᵇDDねエu█◀4\nさ2ょ⁘🅾️²8▒ひキを¥B▶█◀、ハ●とdゃ\0²🅾️z\r\"ケcq*◀Vナさ<わえゅ□W)(░tフJ7d🐱k⌂PHB⁙Kろ8うゅhYmqヲタに⁙やの□\"H^Ku▥cしU*ヲ∧ᵉ{JひモIん▮sぬ:ふe◆ゅNa,⧗Dュ\r⁙こリ➡️)わ⬇️☉8q.8⌂▮ゃx[\"🅾️vヌナq4▶Xゃ!⁘+。★タ▶▥うふソ.ケ➡️b8そHu.⧗I%²H.⬆️=キDハR'¹R'‖」⁴.⁷k⁸●Aち²セ⧗rうI□BれIS/◀カュ☉⁵ク(/¥mc\t!RしDK、◀░ヒ∧セウ□、*pうG<,ケˇ\"さX!∧□'k\0ヌ(こな■ケ⬆️Jう+▮YらナHl➡️48sう]⁸い❎へょl⬅️⁵ぬ⁷、ゃるEヌフホ! \0ク░h7ᵇ░G2□O▮6YうらQヌDヌLチょ、し▥;もEgゃ\nC★!◀hのく!rソ\tdニ‖ら!せ⁵X…の゛▮つU¥ょe☉%T➡️!)\"」⁷★⁴Id🐱\"Tオp^さ■ けI;%H■³▥8░D▶웃るセる♥2²⁘p■と☉▒Q,HHわもH%★■░□さ)▒$ウし⬅️$hねl$★H。n□ひサけるっX☉#♥P\tHH🅾️けIH∧さうっ*%▮□さマ\n★$\"% -★ウしう[う$웃\n ➡️\"\"ま☉🐱⬅️⁷)⬆️ᵇ♥Pたm✽%∧sしIヲF*き…LN\"ノオそ☉I⁴i \"Iᵉd ⁴웃っ(#$░p3tP@う★Dこ⬅️3▒\tア4\t…$…ねB⁸(p➡️⁸➡️⁵★[²ˇゅK²%@ヌH🅾️Q\"AᵇP。コ(ナ◀⁙リ\"ゃ\"ろEa■,웃HW⁴す <🐱T\nᵇ8…I'h░y⁶い@メ$)\r Hなけ!)、$D⌂ま$い8⬆️っ1ん\t⧗、J☉Dぬ⁸\nうB□pᵇろク⬆️IxVIl☉H⁘8➡️\t,8…$TTTᵇ$⬅️◀Cエ☉D…ナ★J「□E⬇️ひPヒしZ⌂ax$な\\C\"Fネ✽コEˇ$■セ\"@オ웃て、█➡️ヲX■さけ⧗ら웃■5)れ✽J8■ˇ6▒H@オX🐱すヌ⁵…り3웃゛█BヌクI]ホ▒⬆️て⬅️■▮❎X$⬆️ゅノちね⁴🅾️、ひチB◀⁙⁷6R'Aろ⁸K`♥PNᵉ`'ᵉ□\"M%[$けI8★lッひ&BXカね。Zぬう,た▮⌂I█ク░✽\0。ろ'□⬇️%⧗ᵉ⁘(あ❎ね‖I$■▮Nˇ◀ろHYbH¹みI☉%★ あ{ケち.▮Rヨc¥4ヒEア⁘ほ⬆️ソゃナˇ%qdI🐱ひT▮-★⁸そlWっそ웃\"buaaろ♪rHさ★Pュ◀iZ)ム[¹|∧\\さ●マ キ🅾️■¹ケたてのB(J⁵Z★2ツ◀H▒PぬへXょ⁙▥⁙#✽KyAゅ\"チそYあ■☉░★xˇさ%/Q%ろ⌂Uる その⁸J²#)ᵇ,웃⬅️'G+、b⁸ヌのq⁙た▶オキᵇE▒V🅾️Lけ$$N□F⁙NjケgセらY\n⬅️ケd3🐱b⁸▤ニ\n⬅️U\"□2Hdうまい웃Iとも,゜░きIbカN%$➡️Qゅろ;🐱チT!●BA⁴⧗sx★⁴▥iDIセテA2Rフ⁸CEVナI⁴l^yG²マsJsろI⁸DDK\tケぬBり🐱$J.F◀t²A$¹!8⬅️□∧\r⁴/I$█☉➡️lj웃■゜\0qH,う」!⁴-➡️S^3#ホさの◀り%cDRりオ\"$、Y))きフ🐱\t¹²しもXeA\nyコEた🐱ヨe∧ホ$I¥EIH□ゃさ9웃bh☉J。 ²。▮$オ☉S⬅️+☉☉[³✽😐み¥#Tう⁸⬅️りフ\\&▥‖⬇️█6@bりしTうそ⁸5²A*'Bユいお4Y5★xM\t웃⁷ニᵉ&ˇ\rbI!□\0。■\" 웃ゃサね⁵)わl☉K1f\tゅ⁸オt☉🅾️$K⁙🐱¥\t‖xスk❎ひ`ネ,[\tᵉ)\rDW□K⁸★‖v⬇️●se0qR7$\0\0こ⁙$Hz¹サゃ>の5⁙とlX‖²X⁸Zさ●★コねる□A@UT⬆️Xs\"Aらつけエょヨヌp,▤Ax…N、ナ▤のD♥1*(pD\"りっFMBろヌ🐱$(ネ❎\0ニ$\"□+J➡️れみ る[ンYる◀ょうこᵇNめB\"³め、X★JX…⬆️sjョ\"ᶠo‖るL ie🐱')zた$pめ\tるTム☉…▮B⁸Hᵉあロ¹I⁷D웃zヌ²けQeQlなl⬇️つ⁷\0¹#🅾️a\n⬆️Q(モ&⁵:モりKBさHうきC!◀Bろ▶☉⬇️⁵█。i(p☉bC⬆️y。■'\\ᶜ▤カa$けW%□\n🐱ˇRヘE☉★▮⁴◆8hI⁘$█ュP!らさZ♪)イの□$★▮,⬆️▒\"+☉□ゃ⁴⁘░⁴モN\n…ˇHかかD⬇️¹8:rるりI:ヒハ\"4pfW'□H☉$\0█ナヨd☉★⌂⁴$ニケつ🐱るGᵇ&⬆️J✽ナ…ヌᵉFうさ=⧗D■b(C@br⁘ヒ$$$?\r゜★し█⁙ひ웃■!ねI■,⬆️□は웃ゅp🐱せ\t■⁸…マ²s8Qケ⁘▤4▶Yを_🐱スᵇヲねさ★aR\"8わb`ツっX⧗@░\"8Hうラ「🐱HAセG 🅾️|ヤテオ⁙き8キD…サ8p,ん²ˇ▤えゅ█➡️b☉!て、\0さC`へうヨヲみュs%!/2BG■🐱わ❎▒ZQろ⁘…vH\"ノう@ス9キ□S░せ⁶🐱ノ⬇️をュ^゜∧█C❎*■❎Jマ%BとˇfユニjEHひHむ\"²U」カ¹ア★…マfヒあか⬆️お~SA「マ%i\"tつ$ち░IHA▮qケb-★\0ひ⧗」\tKG²ぬリ\"さとヲ◜oゃ ⁶う9ᵉひ◀'▮ニ8の\"•⁘しI♪E░さ%🐱▮p♪★Pユ@Rアハゅ*っ_んヨュ■$⁴EHヤM\"Y、▶PIっXチI☉▒•▥5つ1>➡️☉░&✽り▮ナ☉オのi'」ヘ9ヌ\n⬇️G²8むl웃웃9░ ⧗⬇️ノな²⁸ヌ!る]らあ웃ケIᵇ*ヘ0リ⬅️♥✽🐱Jp\r□pの\reqく\nュ⁶はHPf▒#そ#²p^*きあᵇヒ0BHヨqんナあA■&H➡️SE●✽³웃⁘🐱んY&\"H▮⌂む&るq4☉\\b⁵…▮█▮❎*!まF∧…\\ナ,N\nろ⁙'⁘☉a⁵#0pJI%⬆️ひ@をX ⁵🐱▒&た8□C@▥%웃う$█🐱わR2*ˇきり◀☉웃!d&★$😐り)▒ᵉ!⁴ Dそr☉3C0Fp█$キり☉P★⁴☉I$た▶☉ふxpキBき、c%⁸(…AH¥⁴웃dさ\0T… ヌi\"-X░XAP\nDi□っq)dAろ😐⁴;✽ネ▮웃‖ ⌂▒8オMらN□」ち8ˇ\0웃²□くるH$/⁴「4ニqQᵉ.,え▮BnbF\0ぬ😐²²⬅️T$▒ウ ♥⁸ニ\"けI❎Bへ⌂🐱0A😐□dをD[ の(そオ⁸⁴⬅️+ささヌL■⁴9しᵇ▮8きゃ/⁵コP‖❎E░⁴ッ¥²A\t⁵[🅾️⁶1e\0Fの◀DオEさヌ」⁷ $ぬち,ょきヤう■ア웃\0s⁴ ⬆️⬇️オ⁵ぬK^ナI&░と¥ら⧗🐱\"$ˇH⬆️★2|^\n☉(`AD、(A\t…v■✽、Ba`さ]ZクE◀ツ'!、に8█b[ r!🅾️EわD$。ユ★ᵉQろ😐ゃ:そ'2くᶜZ⬅️#レ4⁴⁴♥@sられ░らマU 、★ᵇ、‖ろ▒⬆️ねl,て⁴▮フ▤ᵉᵉ⁶\tᵉヌ웃ら*A‖キ□M#▤▒ひね)L,🅾️(ノ8H⁸I゜²Qh`サ`ろ,▒▥#ウb」ろわK□🐱□V█ン□⁘]²□C☉◀░<:😐\"HK◀れく$w⁘Hヌ@ヘDhBりᵉdY。$웃チ▮Qゃン😐ᵉ\"⁸nH█➡️\t⁴⁙Aニ%~PもPJ▮◝ゃ2ゅ¥りᵉゃりH…X8\"~¹)$t웃l☉たb☉~のめ1$%⁸えh$Wq\t◀すY^,ヌタ、`😐█웃シ⁘?リp\tの;⁴I□dUeD;き⬇️,ロ5…◆⬆️ᶠる◆ス♥▮Hムけ+ ふさ□8⬇️█rふ%きッBケCっCヲ✽░:…さ⬆️h⧗□*²⁸4、ス■★★▮★の⁴▒チ?h!ろ□::ろQ⁴\0P░⁴♥¥TB@け◀R□³ユ&ᶠ!`こユ…웃r⁸ゃ\"A\tahス,キるワひ…\r)⁸wG89りりケハさEq⁸も¥BZ「⁷dTUiD★🅾️(🐱H♥X、³あ5▮Hモ🐱\00009,⁴♥t█~ZᵇD░,)エ C⬇️⁴のめゅ\"く!イ¹ᵉa!eえワ\0 ゛た¹きく⬇️そ\rっ、ゅフ⌂.て░ニ²⁸CB▶█X、\r\r⁸C⬇️D░ノᵇG⁵-らノDヘおᶜ!B🅾️ᵇ⁸マ`や(♥\0P$▮⁘⬆️a@フ⁷★させᵇᵇ⬆️き웃h♥8$ ⁘²░9Hᵉヘネ█!¹ん N(⁸\\✽⁷²◆ゅ゛⌂▮ハ⁙Dた▒@¹ら)ᵇG\\░¹aり□れ☉P``! !り!lけ@q\tᵉp8\0…ス◀ᵉ¹みち,9⬇️⁴▮¹B▮`し&\tCき⁘¹\tᵉD²•➡️a¹ろそE「ひp\0ろ➡️:/\0@⁴¹□@█⁙…$18⁴♥¹b:⁵⧗⁘ら☉B4B¹\nュさ;♥るᶜ2▒▒Aハ▮\n$\"さ(ロれ➡️@ケHXv+せ2%⁘ぬC😐⁸wGノ[!ら9…Wᵉ ♥P0%RJ゛⁷ニト‖%あ,♥ヘ :░✽♥$q♪ᵉR。`ヌ▮•…⁴イケAG▮ュ ░🐱゛゛れ⬆️Aら4ニノなき²²B★‖ヌるDぬB…⬆️ ●,▮v\0けB,🐱¹⁸~¥ᵉく 98XT█⁸⁶ᵇ⁴▮ヌ▮B█\rᵉ▶\n²゛っフ⁴けC⌂▮リな⁴O⁴:<⬇️²▶█⁴ᵇア「%゛アマW'⁘qh8★$!るQᶠれ\0A▒ヲsンゃヲsヒねんs∧,?N-\nM¹,,2pht⁴?⁸H^ᶠを、ョフ[う\0",
_img_dystopian_hellscape = "◝◝ヲ○◝◝♥ト∧けふ}み☉dロナ🐱█⁘○◝ へセt■ihひ!QYYカRg\\Y■◝テ。z⁷、qえ]❎⌂웃d;ゃきzは☉な,タZカRくテb゜ョNaらp…Dˇfニイひ▮っ❎\"わpN\t3ˇキ□dˇb○ャˇ`-ぬヌH♪,ニ!けiゅS⬇️>mとKP⧗▒\nユらX}⁴?ヘhH@Kそ,、ては■░Rd❎jid-ひ★Cツ-█`Bれ☉○ノけLY!、るHュq,E²P⬆️つる★KT⁷$わ☉チ²}ᶠマ、ナ\tREひナJうキZモA∧✽%WQt∧ソ<さ웃ウkᵇᵇJ♥ホᵉ ●⁘さI、っ⁶:uケヌXqア%ノチ웃\"Xミ$s)9ニaさ█HXXHXH0Xy\tEDA$/.えiひ▥をネZねろbみ░\"2セ➡️し‖こM(ぬぬ★,⬅️ᵉaく ░ゃ‖$⁙KcYS웃lつ4~⁶5G⁘$‖ろハ\tろS☉9も3%」\"レ;∧★웃█Hu\tC♪e▮N🐱リxめ▒ゅnM8いう9stDC░🅾️<⁴⁴☉…ムud$\txJ⬇️웃¹\tセエ2*qるタ🐱A,チワ8ニノnチKg▮ヌなカをF^lnx∧#う\\pクqすI3いD⌂8⬇️❎□⁸ノ❎ス-う⁸❎▤…マA%8…sまD∧hC)キ♥キjの‖ てサ6もB$ rさqゅ⁙❎ᵉX◀ヨア⬆️p▒キ$$❎つ■ウハり∧\\なハr#お/⁷□/、Tゃな■コ'<ひあqm゛⁸😐やりJ⬆️ホ!cタ\t□;🐱りケ█オ+ヨ…そノ░ふᵉrJヌPお▮えユ🐱🐱そさd➡️%HLqろHT♥⁘∧q8すへpdうXほや⁵▮N\"リけE、n$エろFサsy!ろわそり█■゛uイ∧\"hね▮き$Y#$■m웃ᶜ\tE⬇️░n\\∧JマゃᵇG□]っ、q:\0✽J😐░³コさを%ヌる\"%なIx8,▒JUみ*ん)ᵉ⁘★^웃%-'1 そ[S✽@S8░のI8웃⁴うヨまハ□XRY▮⌂ヒツうUヌしˇる4웃$スうウ7¥9サ$😐∧ろxほ⧗Zˇ◀にᵉ,🅾️ 😐ソ⁙H∧Xマな😐&せ¹▒.⌂웃◀くをヒヨ|リん^ワミタWな89y\rろヌシフ$⁙🅾️USれ▤のれ☉♪%っ8ケ*\"「▒♪w□セe\"くをミに}∧zᵉ'+タてっ9ニを@ニ⬅️\\~オワDqアな。ろのJ🅾️yH4りJ\tVwろ⬆️Dz★Aん2るlˇ2Hのsまへ゜あ}フ⁘V█♪Nbゃさヌ■6🐱ヌ²★░…♪□Bヨ8…ᶜミ■うHk#ス~Q\0…웃gIK8うNc⁙w□□!●⁷@🅾️W8や3⌂%⧗Jぬモシ?くx✽.rr★と$ᶜf/ᵉみ⬇️★▶^zキTそBス²きも*Eま`⁘フ❎□Gハキ$…む^8⌂るりの웃&⁵み⁴…む□¥ᵉヤもょ⁵なe(JT…¥H➡️ッ%D⬅️へ\t1✽▥!ろi]!GHう¥Iる⁵J…🐱\tけき░░⌂♥4ゅ9➡️マN$4I30yゅK(`C웃■ん>s*Yᶜwろマるᵇ░Nけの&\"TラGニケH4、チヒBY$ひネラキnyさ+ヨtヌイjD9ち⁙\"[さたケ?Y&オ▥れ!を²メ□LJのn…krEニxR1⁙▥\0⌂$♪#ルIわ🐱h▮ぬ□⧗░d✽⁴ロ◀K4%웃ス░▮きキ?セ\"¥FE ■;ヒっ➡️ソ⁸けbF▮∧Kノ🐱\"…Dp☉う■?こH🐱⁘▶I'えヌRB➡️⁷、すの▶ケr$⁷■¹`⁴♥の?ヨか}まネ⬅️t2□³●★Bs⁴⁘\0\0ま⌂J>ニ⁷◜レさQっᶜツ!ろ⬇️つ\tら⧗q▮の%♥キ?ヲっsて⌂J☉⬇️🅾️$➡️フ²EB%⬇️そ▮…8➡️テ#セ゜ワニ#ゆナそ➡️▮²…そあ⁙□□⌂ˇ□\t◀BDカ□F➡️く◝す8U■…,Y#⬆️ヒら😐F²くBゃ⁵➡️き$⬅️#◝lHQ Z░6ニ◀し¹ᵉ@\"!!!¹ム,;➡️◝🐱まコ²ろ□さ、GKdI⁸TT▮∧²\n‖□D…🐱⁸○メ➡️=めqtさけけ▤♪ん⁸U*░²ᵉK\0♥2,◆ウG◜よ2.2¥⧗な%ゆリ8の\"⁸ ▮\"くけ□$🅾️$Xh○メホdウ☉8と⁵Sき\"$웃⁸AP●♥ハᶠュ0ョ!ろ●うキ/\n□\r<☉…4、³☉!,⬅️⁙◝<◆レR%せ$きNe☉Qケ⬅️⬇️ちW▶c◝;○ニ\0!²▮¥H……ム☉$🅾️さ$9iる◝◝‖。K$$☉⬇️く!ᶠウD♥1ヘ◝◜>@⧗$⬆️0つ\r☉A!\nD゜◝カニ⁘⁸Oゅ⁸SヘQき◝◜v☉R▮\n¹`$웃#ヨJ○◝>Hの⁶●カᵉてqさ‖,に$⁸⬇️◝ンq\t,E★ヨA」.Hョtふ`O◝ナCウさ¹}●JY_ちNᵇ゜◝❎チ➡️i⁸²しつ#にヒq⁵∧く◝ュ➡️ら□h9&⌂,ホュ\nハ\\I_◝ゃキ`⁴さ0▶▤◜.ソNN‖か◝ょE□h$➡️ヲ➡️⁙たへた゜⧗🐱qとヌ○◝+$ᵇaJ:BUd⧗ヨほ⬅️せ▮か◝ょハ□.ね(*웃%☉oをふはᵇ%かュ…~ラろ█ねᵉ8QVIるひ゜🐱I▥⁷◝Dロセ;E…すホ8N$さJュa4n■?ッb8つニ;ᵉ2p!ネ-⬇️s#▥J、&は◝とVニエうや そし⁵¹‖$●D:N/{○ラ、,KやmムH★.AA▮🅾️wRフ▮ネせ.²リイL◝ニVに6⁴DハヤI、⁴の=ネなむ▥ろまイゅEえrふ'◝゛きネうナ7~⁴もBキみ 」\"こ⁘ネ☉p🅾️ᵉ□[ま◝ハカ⁸5♥Q、I⁘E%🐱「タ🐱$▥8✽{へ゜ュぬM²B&ね■³▥aK 、➡️シNヲマI8おヨふカ2^まふ!ヲC`ュッ」⬆️X、9ᶠNろヌ!¹♥4⌂「_ゃ□セりeへWヌrBナミ░ナ∧w!x+らxヌ8◀Nᶜᵉ\0⁙Z\"%か✽∧HW#Usᵇᵉ\n⁴=Frハ\tᵇすDレ1⁸ナpやˇを_ん⁴•うBう²せ@C゜*cᶜ'\t□ソさ⁘\0ᵉfq`;🅾️~░ぬノュニ$}X▤웃\"Bマセ9★スョZ☉8➡️&オ;³▶ ☉9こるるっヘ-dD7⁴pH7⁷‖█モったd」dPD8&pホキᵉk=\0j❎た`ˇ¹★うん✽rXテ ¥$pg\nたテ⁸KD🅾️¥%✽%゜Ag웃ᵉ✽😐う,I◆▶♥BM⁷フ+あさ⧗^$シᵉᶜ⧗めh8な。@Hょわ🐱オI²Cなoᵉadう'▶M‖‖るT Iz/\0ヌ,q2シ。ユ²LHもセˇ!,りf●w、ᵉjユ⬅️HやY$っ8@ユ●bGフ웃に、2ヨょ@█⬅️.なb⁴.ナぬp➡️ろ…ふつ\n█🐱Y8B%▮、w⁵BDメ0✽オナG⁸□てニmヌIJ[★EI■'Dるを■▮ヨけ²8¹□*Sホみqす⬇️♥=^⁸ˇア8D🅾️x★テfNけXのId □t⁷z'VH@ね'ネ⁸\0Bてt⁵0ね/0Hヌ[hえI-●∧pふ]うrI,、웃れヨる□#Dナ⌂…▮█$e➡️⁸➡️□AオD⁴あI∧#あヒ⁴へ(‖'□\"ろhき\0。¹⌂⬅️ ノ🐱BJ▒fD~⁶ソY!\"⬅️ン➡️\n⁴たpハ░■&フ░う8たラこ█もス⬆️ヒゃ⁶⬅️□$█➡️8もリᵉyコ<1□ラ▤ホ%+るG‖\tm▮^x웃\"^'|るツゅノ🅾️jねさ*I◀ゃ*qd ラ8*TEん、セ⁸Z●^\\さくる░.ヒr∧'ヌは、AわLH/★EA░9*キる⁴X□¥CZメメネqん、q#Eつ,;Nノ/R$T\"Nxp4⌂¹ケᶠ'■²\"nノ ^l♥▮t¹ん2\rᶜ★$⧗ヨ⌂⬅️9しソ,ヌフ▮☉ヲpH▒Aっ★,░웃▮$▮1\t□Gbそ♪ん⁙'5る♪o5タ◆$'⁶ふ、ま$HG\tj³きN◀ ちG\"p□(サXろ~ᶜムチ□▮➡️□しヌdノ🐱⁙⬇️\n□$✽⌂ヌ^⁸Sま😐*D🐱ろB☉/えpIまうDハツHくF「█[█⁷、く\",웃▮8X*Hイ□Lけ\0=I⁵∧!゛⧗か9ヤある¥rヒGK、らW*✽□B➡️ᵉッ웃Iゅ$🐱ケち\0「CBンへマsエZsょかd∧っフケ[g☉➡️VロりBト▮ネ ヌB⁷■⁵H★^$★ˇカ◀さ░のきZへCそなめすせ●ˇ`Xえ0☉⬇️▤ ★ろHねQ9H²D█🐱…K はE░$ネまねxし⁸⁴1ソHさ²⬅️ q░サて★\"█¹;TE⁵ˇ⁸l⁘い、tと²웃+え\t%か🐱LU@ノDおQ□$☉こ➡️JYl☉あA'Q%‖ま✽+ ゅ|4ょxP☉A'#め$!\\-∧wd…ら-ˇろ$T@くりdH♥.⁷▶░メ‖□れ♥ᵉG▮2Bチ⁴⌂□\tる□(♥😐\t,はと⁸=タ◆I⁙まそᵉ'0Kに⁸なPイ-ク\\tG)ら⁙ヘqbFp∧`★⁸ynˇtCいxハ⁵G7p▮\rなしsbA\\$はた_てノも\0N▮~ミS●N3Z★、H@●⧗…⧗◆¹★I\\F⁷¥#🅾️hウy░□<?Yれラ!シ⁴Yd(カ□\"Uい●、\0░ネ❎\"Nᵉ]$H'S❎U_えRR▶⌂🐱GB+あ🐱p\"$オBOl∧▮🐱リ8ナオ∧f>りᶠエえ BUBᵉPた+-ナ웃ろ⁴ラ\0◆ゅrUE=⬇️リXQQ。 h…$H9░◀■E➡️⬅️\"⧗█p⁘TpCた³ユき▤ルオX,D▒Dさ9さ…ワ🐱F.A\"■8ム☉♥ハ■■■▶い ャ\"\tろ$ョE웃…P~X웃\"さ☉ハ\"?と▮っ░ロ★R!モᵉ■ᵉᵇ$A웃0□N(DそA?²⁸☉{\0」◀¹\"BrDHA!➡️)ケ웃bq⁙r…Bwj)▮\0ハ ◜◝\0…BDよ█■⁵2-➡️ᶠ▮rˇ]⁸た☉コ⁴ ★ょ◜A▮⁴DDqる@X9B\tヲき◝ろ⁴ED░⬇️Dnら?な`!8\"8D{+◝⁷>。'W#■! DB$ナ⁶☉w■▮カ⁸BノE◀¥G◜🅾️k🅾️ツうuの⁴さt\rケうつ웃zね,]_∧\"`マpAク*□む➡️ャ;♥ら…⁵やあほ\\☉た「t🐱。…‖XI8H(…メ,8?A#テb!\"bI4r'Rっf░⌂ゆり\"ᵉ0HY□□■'▮E♥ヨ9O⁸★□ᶠA²⁶ぬ8$ろ⌂□、➡️⁵チう⁙なけG\t#レ…░♥せ▤$🐱Y\"$ろイ。FDえ:て…ヒB「。、Bり🐱N▶sa¹し!!シ▮★BX¹d ☉🅾️⁶ミくウさAわ•C⬅️♥'⁸RN⬇️⧗¥。%=&Aら-HナBく■ア$ヌ$ナやる\"リき…T∧、0😐へMト\n⁷‖\tゅ▮➡️ く@、%た%░⬇️たZ◀rえねg1ら🅾️$mろEも□⁴🐱ᵉ☉G¥BQろ$;Kᶠᵉ¹(、48Xキ♥$FヒH<ム\"$GキD█マrの'`゜サCえ‖9☉た+Hす🐱さぬン⬇️D\t⁵⁙そ🐱(の⁸?ナ🅾️き'オ`う█✽マH\"□、゜て🐱ᵇ⁴⬅️⁷0\t_ほ2Aや\"⁸HHの9➡️ ░らけり⁶そ…t²ᵉ%へ⬅️\"Cあ;ッき⁴¥\"え$%#▥\";ヒゃ■Gわ➡️っ⁴*8²セ、▒めYTね¥し⁴ネキ☉▒!ナラ\"\"4█JHsURDマ\0らサD■B」BT⌂☉P웃)-🐱゛ヘ●!ャり9ネヤやsヲu5むテL☉X!っ▮け✽ノキ⁘!れ!ヲまあ‖っBF♥ゆレシ?sフネヲ`\0",
_img_prosperous_future4 = "◝◝ヲ○◝◝♥ト🅾️いbや◆オ$みKD「゜くS[mし?~%こ ‖れHˇんX?Xh○タqイwxフ▤ナららフい9ちmさ^#た なみG\r⁵qすᵉ9³⌂($?ちへセ#みg▶^ た¥ユ&AろサA4A¥j😐e、aく!チ⁷█◜てむ+しのキケ')\nN、YK$Nl\"ゅ[\\RBQ!わ■1d○★ホ,おIす⧗U⬆️◀Hそキせvと…Bて웃ゅ➡️HwᵉゅpP~きpサさG+8▮,、さキオ;YeあレcTノイ\r⁴▮ヘふ⬆️ョs░★ホは$み2pはF6ひ♥J⁙웃s웃ᵉᵉe⬆️ヒ\0ニ@⁸q\t⁴!◆⁙ユめ⬅️g¥く-た9ヌK#▒xᵇしフヨTサI)¥▒█➡️\0ぬぬモI◝🐱ラFオもG²!g;✽★wnk$Nm…!まつ0りm□□。❎VE☉Mᵉ-ほ▮:ᵉ%ヌユネ].S%DトK-V@Af「웃C⬆️●░░█Iおn'□B&^なた'⁙■<YZスう▮∧アモYてひ●K]わ…PTDBEう²るBフ▶♥」ふuへSホるウ,ナひ⬅️&4[0 ⬇️あ⬅️_あX░YD⁵G lpp\nLむ*ユめIとるq\"テ5のゃ•{なヌツん▶░テT$け」8■u웃#h(⁸8²4 こY♥;るミ⁙tタ)$ぬFおTほ5∧(のミ¥,カ□bてqu…■□Qアi⁸!yもK⁙N/nxもp}eY⧗ラIとヌY+$くg\nゃ`#KlV[」x8i$⁴ッ⬇️DᶜN✽HヲsみもM□Qヒスとzねl웃4I8$!웃%I,Kわ2.リK⁴ᵇ\0🐱(|²⁴♪イリJッヨe➡️らI■Hマ*B‖ZDxYWいI!ス☉2¹ヨ$ ぬうさ⬆️★ゃNへえさッカなナBKx∧hユ!%$⁴S♥hIᶜ★⁸0\t ~ᵉ゜█Dえ‖\"]ア♥ニコをチK■8ゃぬBケlさA⁘■れ☉なオ∧Xt⁶ᵇ\"B🅾️➡️'D⁙🐱ヘ⧗=\"…の-☉▥\0き\tmえ]\te³と%RXけp\0、さ█ネ⬆️★\"アナ\rけy,う.🐱▥l∧jの-⁸⁸AdT☉っ🐱H…🐱ᶜ\n?ᵉニk◀¥メWW∧[*ちむむム▮J9ノ$$た8G\0`ぬ…ぬヌ\n⧗っ⁴◀peるᶠbD4⬅️DEわ⁘!ら!aC\"4#²ᶜ¹ᵉマK⁶ふキcQg⁸{ん▮●∧\\⌂ロら⁶■…p ⬅️\"q■-█モF☉Nエたる➡️∧Hᶠ#■fA%*'F%ま●B` □‖$オL¹⁴;ュ ✽*N웃★r'▒\\•🐱➡️Uせ⁴「pDた#リ;ナ★ᵉq!⁷bᵉ$ᵉ²す☉ハ⁙ノあけB、えサ‖む웃わ*く\"リ\"゜⬆️…wB²3け▮Tさりフ⁴8チて★Oクq.ノ…@KdTI゛Hロ▶…³[(えqn゜xっqシ.ゃl➡️きメ&なᵇさ✽³た\"□Gフア²□⌂9PLDiて[おヨは◀ろとd□Aワ|N-☉ZJ、²。🐱ら`! 。!4H*くxOれサツ_K◀➡️!hヤゆ8め░ま░;➡️っ…$▮█ノ░ねタ░2Z▤➡️ヲリメや^「も゛リᶠ2kし\tそP)コ¹ᵉ!ゃみ⁸D░/¥ワん³イCつ□ヨˇふ▒,&‖`▥.□…²p!\t…き\0ᵇ▒\t⌂⌂a'、B゛mメなc😐➡️ᵉ'\0Cうマテヲ\tわ\0iVB□□⁙⁷³EB~:セひ:q~p★=イ5ち❎▒⁵ᵉん□キ,サヨS;■R⁘$○fっEあチキも🐱ソIJた]Q⁴⁶、XMm▒bき、☉%9P…ョSしK◀O■▥xえAわIS」をぬ70█@の8やし🐱ヘCた⁸s\tᶠKR■f⧗MjラやしもH★4▮オRく<8[に◀Zヒ;□あ웃░C☉)?2DBv█り9vB}わ⧗N#N⁙ユマN'■dな-フJチI▶³ˇヒ¥、✽I_Jう$+9◆せ<Xちカ-ロ、ヨ⁙c^$!?)⁵ュZヒO□^!5\"Sᵇᵉ░フね'\\NさタgIノニ%のQ□O⁴ゅ★ヘュ\nuj4Lまチ🅾️オi*hマqせWらうコs?=%のU😐オやゃ、セ²れノH゛Iろう🅾️ えせ\"eめなHう」エ\tカVqッ|イすD\n❎っQ!ウ⌂え⁷2。ql゜😐うラへセ'◀‖LもはaUAp;ニアもNチ□ホᶠy😐B)1ゅ)む\0☉⧗■アtfも■][■H(:IG>ZヒホlKろSお\tき2H➡️◆!ケ✽の…ニイNREツ*^e!+Eニ$#░9た★pH$★つむF`8■ト\t#のXぬ⬆️う^8]みˇ&*つY□B웃G<に9$ヌ8ぬ⁙てナs「ナしナモMサi³みP➡️ろI□Iタ□JたD★っ✽✽;ウDう♥⁴わ∧p⁵\n けユ⁵ゃ!らゅ4⌂フ4i:ぬXニとカん□、ちJ▥ろ0、⁙、ユ웃わナ□ニ⁶Lr$Hひヘこlも\\イ:ひ5r]Sふ-qxH웃(れき¥+な(キH░)□r☉⬇️🐱JへIᵉ♥゜Pモ「✽•♪/ᵇ$ヌ⁙ˇ∧ん、ぬAzネEしそ」⬅️ろ21⬇️▤☉YRdˇあ[Sつyzくうqチ🅾️、i(,カろYってぬG⁙AアをうIᵇ⬅️ZクえA■b9+めシ14ねS■%YbゃN9ニIねゅ^⁸マq▒ょIc]\\NᵉノXゃこUZニV[⬇️░➡️サクV⌂:&■サホサナミ^'⁘…XAヲB-⁸ケ+X♪‖ゃわ…きYFCい⁴'□ヒi⁵Yる8⬇️5ほ❎ネた\\フ<Xモc⬆️░Yりg、ょVヒせ+f😐⁸HKlえI⁴░➡️●I&コ⁙な⬅️N やテ\nチDえ⌂ミ🅾️\\まW²88t⧗☉なl⬆️のXエ\"ユᵇ/ᵉしTニ²'⁷□れ:sサょN⁙え」brけT●2¹ゅs⁶Y³つアB$チJ@[らっウら░、ま■ょY$ナ\"Dョ▮V/=アqMて▥4sイヌちX🐱ヨli5うI\\%し8sRK'⁸な%ハᶜ9▥むい\nニわうAろ⬇️⁶\nhホ¥R\\ほ♪てTふむ█^8웃0-カcれ\n$oろ∧Kさs□、セᵉWI ヘ…0❎お,qᵇけきひや▤XそrpしCたわイり、⁴w、N'%G◀スワ&ソ▥ろケXオう¹けF🅾️%ッけ3ᵉx¹をれ🐱,ふ,uき➡️…zおp8░う Bdう➡️xKTふ◀ゅリ☉え8ヌ…?⁶…🐱\"<⧗CQ、ょ$⧗ナf¥&ヌ!R}\"😐✽H∧みゅr⬇️セ\t☉*コU♥⁶\n▤⧗ゃ$$4キみスたR=ょ。ソ9キI∧り⁴のHっ🅾️!Qれ🅾️)Bヨ*メわ⁸へヒはh⧗8ˇD★▮⌂G¥9ハン[キ♪アN'*q」7⁴あEら░り@✽⬇️おᵉ'ᵉˇ□ユニろキサp[と‖□4□う¥tGニ.iく5☉D…,²I4⬇️⁘ミ⬇️ )⁸、との」웃▮キえょわしキっKa*\"さAサ∧わt∧h⁘zUキB□□Sの/$░メj⁙%⁸ニ5!ま★Zュ&セrYw□⁶の□|ュ□ろhコ⁶ハ8∧3⌂n⁸X🐱n\n☉K⁷\\28Aゅ、zちwRろふ'S░❎█メ⁶'7✽ナネ⬅️*ワフ、i0へ8k\"Y#🅾️y\\ふ\0I,█…r▒ろBN9ロ🅾️nつゅみ★(⌂∧ VqさュそうウfpN$:Hつ8U♪,%「d!キ⁸E!クA9たわ、ひクせ、ゃ+🐱^。▮ク☉ウセu+❎.■ょや2ソ⬇️そミ●HさえYろひッそI\"0ぬᵉ\\$ ▤フお,ヌKむせᶠ4q■あ。^eG1Qbろ•\nIロのdサk0⁴の■ᶜpシ▥Vユj…8⬆️ナNキょQ.な◀み=iさwせ□웃わつえ'¥@u\"D⁙dしセYわG¹チL웃R*まキ2⁵ えて➡️⌂せ🐱ユてはみ8⬆️✽🐱U‖cZとみ█ハ4▥ウやてMセ❎う*4ふゅイさIっ⁙@ニR⁶웃EのIモiんRタbウ6そD□メjょ^G):pす♪をそ$⧗ˇDT░$ノ[,ねれFほ웃しなノヌ#dueH^g.&웃tふ*▮サI(Dう]ろ#●ひ,マ¥jWナ∧セ\tる⁙…□⁸カ‖、⁸む(と$2らO#ᵇるふ4$ねd⬅️ivウ8erフ♪けほ⁶pサ◀\r5🐱ア…\t웃{@つUュBr^□ま\\♥ネ,➡️♪(いIまけ,モ★D8…y;ヌ★Lキ\"^、¥うRe、bW&フT░B0わうょ□3s□ゃdな░のテ$ね⁵∧エ&🅾️G⁴⧗✽ネ✽J⁴u&ハト<sしスひ\t2ょれM@\tt⬅️eフ░ソろpB3きのˇA$ぬ:★とニチこた、に.□4⁘:hチをキ。sゅケwS🐱えっ🅾️yナ█ろ▥たメ/+8★XBち웃FBbB…ニeヒIタね9ヌハあX⁷ねyサp▮q$k➡️!e\0う★ユュ\"っImp⬅️[K[KdけAこKアi#^\"8^<ウタ$rネおN」HYつ⬅️イチ5ホり‖*てIクタmンイし…tT¥KM:K▶'、]jJ░웃マ6%6ᵇせRqk♥\\uを😐█⬆️ヌHHうUW2さ♪ᵉ¥8ヌ*\"すᶜ★ひCルIわしツJTつスサちっ\rZ/N゜せ□|コせ▶K,$'ヌ[eへ-もi%むJう]るさ░い8ノ♪ ◜'‖³¥IQ`のeY%4うbモxうHs$い/⁸、4Pハe▥ ニ$★pˇlIww~9▮★てU\"ょ‖⁘♪しし\0❎リ■Sq4░➡️うCゆ\rサねVウQをた⁴)□E⧗Aˇ$k)x▥をZyと[X✽hろKてH🅾️%●のT¹ろ\0なか◆ほえbKゅ&ウ」ゅNM/}み⧗なき、🅾️⁴\"まそ0ナっ=^⁵てロi♪²ま😐 ワ⌂K/4ˇう\"bKゅん)しヤな★jえstZrシ▥ゅきᵇy➡️'-$‖ト□D★9f✽▤ュ&☉UまヌたあI\n…}rリわホト)\tけテ⧗しウッマG⁷\tイNちけら\tめ5ツたメ'□Tii$웃⁴q=∧5Mwナ^$♥<ヨすレやフ◆▥わ▥$セ、ょaみへし ⁵せᶜナ▮\nむNᵉいU■ケ…ˇホわse、jカ⁵CそXナ░⁴⧗u%^8★pネいれ❎、sxメ!4Aオ「웃ケ*8⌂E&❎❎tI-D5ヒラチ%%█み⁘🅾️ネN。コY□X🅾️x^.qろヒネ★▥ク❎<メるYゅ#ちへふノな+✽へ4■_こおd;み'\0へEちᵇ◀きnさヌ8rナ★q5もョメフひ❎3ろ9,⁸Hたケl2🐱8ぬニうqさカ⁘.@りzqt♥w♥⁙^🅾️N1yネ♪▮も8¹\\ᵉ、qik゛⁘웃っi1‖っS☉9vサきサワd➡️く!ん¥&ˇlチpヌたDッせ」ん‖ᶜ\0‖ヲGi)るホᵉ、sてな⁴🅾️∧8ˇレな□ょ⁴\"セM,しXハnP░く★‖ろuトRsまコy∧リ$。ヨ9ミ✽●うん•★わ9q*リq◀ZカSお,∧8★ソr★\"\t⬅️□∧Y\\ょ⁴ふゅモしiん⁵こ●えp⧗れの.@😐うゅニタなヒうlホ\tソRAK8☉ナ%⁸N\n(うKa▮ヤめ1ろやH~\0ナたjしpフZめ▥アケなyっヌiyせL9wハねˇHマ³、めさ█<へRケ)◀/\0[l🅾️JB9YみヨるmJO□テ,ソsSLさ🅾️\"9マH‖JRひ★ょ!yˇキDネ█…、Iゃけ=Iz♥⁷]q~]⁴も。こ#ˇN\\⁙\0\t9❎웃れ[を$VヒLシ⬆️wDˇyね∧ᵇ4うQキ^¥[Zラ[□,えx~⁷∧マえ▶wム❎🅾️:wもモpNQg'せ➡️ろけ;よm;⌂Hれ⁷ひ[ツG+&$にと★ちセや■8ねᵉm⁵ヒ]をN9qヲdコ⁘★ti⁷zむ⬅️ろヌきめ⬆️ˇ`5っュけナBBみヌ🅾️f/5]e-Us🐱ヨbロXヨ{リクフnふうウYっCるょをマYkの$ね\"C⬅️ケりわ∧*EᵇVセa\ty█pA█\tPマレZに@I9オO□dそP★Bqる2B#は-DU∧4★8★ᵇdい⬅️(も%➡️▶ネqるりˇケKさわ%セ…iへ::⧗め!:ヌiIゃ!わ…²Nᵇ9れ²り-★🐱らやユ⁵Rタりしム。}`ひpヤwろリ➡️{⧗おを★pそ➡️\0009I■R✽$³⬅️nねe⬇️*セRヘtフウ%8q:N7 %³░キセᵇチさK  ょ⁸/⁸I$ありi=はY\\⁙めmDそIけマモっqむ8ᵉ⁙てえqわた□うょイな⁴@\0サを⬆️は☉ $pi⁘つ*D…^⁶uケふアJ##?、もリろフツ9;ニエ7イろク⁷り⁘サ\"」ス¥Y#れ)VjwP⧗ソあRワ$しvのろうわえKupヌイᵉゆヤ▥7ᶠん8キユリか`ヘ3\0000R█m9`qo□-ホ◀qる☉そは⬆️う⁙▥#★⁙スBDえソ•ほ。Iらヒgめ²¹▒o⁘Cあp\t$ュ.ニU⬇️🐱まiQQ8cたW❎rIてニわI³NおにoSは░/ᵇ$♥⁶\0001 、²▒うᵉ▶⬅️eg9y9マセcタ⬆️へ7★さ'.▮⧗▒UQ▮Aテˇc\0('‖`\nPL⌂け dぬ:き$H🐱s!▶み□さT⌂r¥$やᶜrっ♪4けた9P(⌂█²KHた⁴Pモq.★so&IW░•(GN+PFゅホ∧*し★ᵇ@□▮ゃDE²ま。セ&[□|…q□H웃⬇️\txAゃみ²ょY゛,チヨ웃wᵇみサく⬅️Pゃ-█Aツ★\"DD★Yちラᵇ9HZ\n\"!6 IヲIけ)す✽Hやs1I^2@さ▮\0ノa8ˇ\n웃、ハツnヲMBつ\n█」'ᵉuPナナ웃R_#*ygせ、N8そN:ニろ■らけqアN,➡️ま⬇️⬇️く/GYN'Vし✽そ/ナ✽%のうえの^W웃と(そmS웃%'<S%わ$チ\n★2¹ろてAイq'*✽ヤおV@QQ\nは⌂nN🅾️²モ#✽フQzヒレ8G◀Gmワ}r∧ょ\\ょ]8🅾️⌂³▒\tん[モ)わウ 9WNAe Bア🅾️。わめ⁙☉Oᶠ\\tm\"V★u9ほせ■ろネめセるてK⁴イyGも:=\tりサお[もyのリ うる'けさ/t(□%チ⁸v$ひ.g▶Lあ,あひ❎⌂I'○sワ|ユハ8ヌNyひᵉ'$マケ*ま:➡️ケY7⁸ユ「⌂AみX□Iイイねndぬちフやろ✽やおKx…9ミモみうd🅾️b⌂Il□]」シ;$7■RᶜチUM⁶Dえ[lYりw「つヌW'\tろふ:Ka⁴eネ✽゛uトやwろたw□もニミ😐ハ…nせu6*xうまメN⁙xせ゜を⬅️ょとzヌロおrvのヨ‖とR8セ♥\0³🐱4ゃ■ツフウ◜ネ🅾️サ9□ヨ9⁶K]xタちpネな\nサNIlミテ8ニフh9YほRシ:ほ★cN。 ⧗…□★]りケ▒`ソyB3⬅️zヤハ^クEヘ9^8ろヌにns♥]よn⁙♥9ᵉ]ヨy🅾️う4%sチbIん⁷iを]xˇ\"テiん⁴BNンレゃをg:R9^/=れアる*J▶◆2I}うo、qケゃア☉□rヒᵉ!ア✽rネ▥シ)あセo⁷<、キ:😐⌂UうHCユqイ⁷(R##∧そAト]Yんᵇ\"Neリ♥♪8c🐱け…8ヤつわ\t▶さ…メをセ⁴レLフいbソ,、²★A\\EヌまYけI$░w★リシ?⬇️ウャワゆめp\\゛、+░G5{ヌまミろリ*Tミアヒ2⁶★Yシ|ヨト@モヌ@。しOんK5Wvq9ゆZ?⁷=ヨ{ミqん]\0\0",
_img_runes_glyphs = "◝◝ヲ○◝◝♥ト…\nすイwねセgミ⁷ (\"U░けmるN🅾️zえ❎🅾️9ヌtニソG◝☉uっ\0h\"/⁴⁵ノツウさユロ1c❎ノ}ス²゜ン!くり³キ⁷\t[웃\nGQgogQふ&⁶け⧗²◀゜●\tᶠヌ¥▶█♥なᵇ⁙⬆️☉も!_⧗⁵アそゆZメ6★□すDュ;\0C◝X¹R*‖-ホし웃=ネもむキqᵇろを□¹*Bりᶠくノ<♥0オ⬆️⬅️G■J$いみソ7⁸ゃまえフ▥」</▮2-\t%sっ⁸qっ゛れ☉Xh⁷ネイぬ⌂チ,ほ$q'<■/⧗웃\\ケヌ8み>⁶⁵¥W▮█◜ニル,$、まゅはEAミイ░ヒ∧ヨ⧗むやゅ🅾️▥,★NVヨ、³まI웃□⁸!a!ろ<♥□、ヨハっさな%タ。.。^▤カるホ⁘LK$9b\t8Q8AヲHぬョ$H\\ᶜSqYし∧…~、^-のtあqるれ⌂チzの+いヲHせ‖9てのょa\"りら\0C▤HHy²ょ:⧗웃▮◀さ❎みいMへUyえX🅾️ミ█A$hしワ◆\0BうBちJ\tンふ…ム‖o□J\"Kh⁙えなテNワ★ヘを★ロへわヒュ\"2²r★rの?。➡️ヲHゃN&□ひ∧Y▥Aケタ9ク😐ュフG>u◀ワyナ+り'ゃV1、H$,。●ヘロGD🐱▮Bsしオネ◀4Eフs/<ウxフ8★3、フUケナ◀XカbN$🐱Y゜Z.はわ、っネ\00002カx⁴➡️□ヨdみろネX★わ∧る²ゅ░ˇ&さs(u⁸\t,レ9けC웃█ね⁸キ▒$ネQ*ん」シ■²まラD9モHTZHへᶜ、▥d:qウ\t⁴さ█R◀♥⁴∧¥HネW、,コん웃ん.•た:コアu%ˇ\r9のS\\Xvh0Pz▒タ░のZ⁘□ん2ツ□フWなvロり(yとま🐱s!⁵★¥\\せ2-キSなr⁷\0#つ#□ᵉネT,ケ,キ8W<めニ\tpヌEBH◆%Idn$GヌCゃ\0vY■%ひた⁘いい:こ|チまいNᵇ■y∧リ⧗🐱Xねニ$zYナカコうHBヤり…Jサ3う☉`IWちN,の…W⁸ニえu$ねフ、ヘQ*Ch■Im@わNヌテ-cむ⬇️DニKRて⬇️⌂\r⬆️J★*EのWᵇ\"Eおレe゛を⬆️ニˇイねんvHサᵉeiるょ$⁶▮▥■,q\"✽ぬK¹lU⬆️ネ☉う,キsケH、kっ⁵サクらR@y\nカ;RDx▶X⬇️ig1bそソpエあおホウコ♥D⬆️b▮✽ qBNラ\t⁸y$…✽T░VえLい█ろ^)a□9웃、-わヌヌKトエw□っナ◆」)rタ/\rᶠヌケ!  く,へわきN◀‖gナタ🐱h⁸⧗s)⁶♥$i■CY/f🐱、モ」◀%リHe🅾️xU8ふ▥&のZe2ソ⁶あt🐱J…い⬅️!⁸∧まこ「うヨゅフ★まABRD∧i:⌂ニm\"+3KN▥9ゅH▥、カろTら‖$DCB¹ᵉaわヌb\"8A 。★j■\t\tW●(うリNマ8D%Pリ²8!ᶜY◀JヒDえY⁵。eえわJ⌂➡️*ᵉ³0^‖e U」▮xミNウnネ8や‖,H²YRw4🅾️⁙ラ✽[*⁘‖◀2\\N*る(░ちヌ0…ひj★リた⁵KDˇ $%U●♥へたJち!、iRlなx◀⬆️\t\rれ~⁸ホエnゃ8CY9⁴q \"⬅️\t¹!aウᵇろ²0😐⬇️,TキろねるE+Aろ⁙█▥ア∧R□tす[\t🐱CBれあタお!1、ろの□ち⬅️9웃⁴i▮わう]ᵉzツ55ヘlam³,(□⁙⁴●🐱⁴'「B♥□さNPや゛てくQ%ふ!,4🐱すろつ⁴[しサ*➡️■らさ☉(▤<⁙てもタ\"@░Ky❎😐🅾️メ 🅾️」RえリzなてsIネ★⁸E★ひF$DE•ぬ²⁙s⁸きな🅾️▶めつしZT,ふ\n🐱、)まHH웃ア➡️;…ヌっᵇ⁴、D⁷]ホ⬅️mのオ[!サ,り■イ★Tあ◀…ミ웃スヌ@pH▤@Zそ⁶-+TもxDBヨ」⁙■'(😐へ▮U➡️•T∧!(⁘p▒#qbタソL!\nニ²ケqV⁸マZTY$★ろ✽➡️8DくP$▥さIヌH➡️JC⁘DJュ‖⁶ˇRょ▮∧Cね□し●マH⁸⁘░😐🐱す⧗'03[。I@-i%⬅️$☉]yKmD#さ$⁘くl&ち⁘にBカ\\T☉♪ ュ,は$I」らT$そ■くQ&しIRHyb9▮EうEBも◀ろょt⧗³웃eほ,😐…ミ▥★り%░#ひヒメZtゃ9Fしつ²8むpヘかT⁴、BあE\nB,;の¥Qˇ$¥\tハぬ+█웃PU◆ちさ!)²Gケほ%*るM\nU∧\\ニ`cDqRU★よuUひ[¥Iわな▶웃9🅾️■R★、‖D)アニう8☉%🅾️ろ░A➡️⁘ウて#!ie4ラ\"メ,ュ‖B[f:IゅYᵉホ◀➡️ろ、AるH➡️ᵉ◀◀□K$*うJ\t れ♥xけ-➡️%q▥NVSY[Rkまあ♥★)\"ス∧ヨ■4、り\0🅾️まX…🅾️웃jDq'\0う…⁸F█Vそ&☉Q\"Lさやs。Bくカ█□ねれ⬅️E6(2H…@Ieほ~ᵉRソのけく,RN&i9P#ちIdネt%X∧\"-□‖bケ☉pGUQ\\わ⬆️⬆️★%Dたb⬆️ニ,Q%★@☉¹、□ˇᵇ➡️てAqゅセaR⁘▒Bてゃ`U∧BY#⬆️ヌきI゛qtさ■アP░ムUJ◆わj…RY2#웃⧗BXてこ▤ひs⁙Y-J□h(\"K⁘なa,HFLp➡️ᶜく◀(¹mはしま」`ヌDのイ/□-☉Q…⁙KIbM$つiIちKすI¥¹l●けAQᵇW🅾️ルキイXけさ⌂░YチそきYSR5)xA²\n★⁴ヌ[<えす★$う「◆☉🐱,しvHRj[と➡️□W\r⁸BU♪5DE⌂)⁵HB²コつイl😐⬆️ネIそJ,\nた\nYu✽ちね◀ふヌ$&IQ■\nGJQ‖ █-ˇ@!8⁴Tすメ,キっはᶜさJ🐱)/RdR²エ,∧オT-AeJEのコ#Kpr,✽ J웃a\t▶▤なろ4bF\t▮あ⁸けh◀のH⬇️🐱★⧗`I、!\"な\t,Pろ🅾️□⁵q ⁴I Uの_4ラ@ちZ‖e▮¹=ね5のセZ9웃Ujてˇ⬆️☉のQ*わの✽H★ねgp+り◀⧗웃⁴⬇️TEそG5 *さ🅾️*➡️□イK🐱■$p웃*e⁵マAo█☉オ⁵IPiA\r¹Tね%ふ?$☉ふU▮rᵇみ✽そむ⁸5こ웃Cの■T¹くd⁘のXのあ¹)V#\tIノねQg+,4ZBBワb⁘🐱BケT웃$そ□#⬆️!イD$`%◀ょ▮…っBセ\0ZさBE$…ハ¹,ゃd\rI▮█I*キり`E⬅️イぬ♥ネ\r\0Wᵇ\tろ$Tた/²オち$]わ\tけ'5¹\nNtけDYRカ、D\"E░♥▮⬆️🅾️さ\"さ★Hサん![Jの!웃ろTへ□⬆️K²Xち➡️⁴$M■\0$웃\t🐱ら[⁴⬆️D➡️=\t5ねl:A$L¹¹²ぬ✽ま、っもDし³、Hキさ¹c$‖\tdY⁸j⁸ノサテe 9🐱P$HH🅾️$)T❎⬆️⌂DHぬ☉ろI▮qi、$けけIC#⬅️eて░⬅️ゃし1S🐱り⁴…QアIヲ☉D²⁴⬅️⬇️AA\\タ■*う²ᵉ⬅️*わy,\"Nノ\rD🐱S@⬇️っ☉⌂X■⁸🐱YN¹uD▒◀JUちPZさ★D★\"$ふ¥Uキく! け`ぬJモRHBむZEねHゃ◀➡️d♪Rさ⧗,◆サタ⁸そへJ⌂Tす⬅️<ˇ!チ「◀◆ \"\"\tる▮q\0⁸$▒u@ナbを★TねVさまt□りセエ0□▶⌂G☉さHTh)R\",➡️bE%G‖□ie[#QDY‖ツEIア$<⬇️TBx\"(⁴░:█ホ\n⁸ キた.の□H @BIaU#◀kᵉy\n オュ ね□Gp²ろ)hE★イ$そ⁘⬅️,UもiJひ²えXよ🐱i\tᶠら²ち@み8■\nUAA²♥%∧I)J*さ⬇️░く¹A\tノ⬅️⁴▮オナ◀□コD☉9★🅾️▮しi$X⧗ユくm(ᵇj웃%Jp웃?」゜⬆️/¹¥H∧ Xま!\0‖¹\\て★ウ∧Icの☉)HK-d░♪\"れリ🐱、CスZ⁴ろp²Tqbキ☉█$Nそ∧ᵇキ★⁘\rᵇᵉ!ケ?,ᶜ◀ᵉムHK▒■\n8⌂⧗☉さひtぬ➡️d░⌂きq⁴,8♥ミ⁴?⁸t☉…サ□⁘Hˇ\n◀ゅR%し▥%のKア⁷Pオラ◀⁸uᵇ⁴8らけヨ■■HB>ね\nた$□、◀ょ⁸ハ⁴キ¥\rᶠ!ュれまXM⁷□¹\0*Q³%てへ∧D∧XV▮😐V,🅾️aaッれヘh,T、■◀ゃxたたる☉しk)キk あ\"らl⁸X!くッれスq⁴⁴█\"け,は^ 5∧Mf●アUˇ‖⬇️ま○ナ♥…ス\"て⬆️🐱ニ\t$ふ❎Q'ᵇS\r-ˇ4★p⁴せ0E…🐱゜😐=らカ¥⁘ ヒJB∧[!■◀Z'2$▮e¹□っッG◜.‖\"ちヌ'■⁸UネR」,U✽😐ホ◀てゃBろ✽コ□⁸!ア$$$$:⌂⬆️むう%%eIbUm-⌂ ▒うイ*%>ねDA/□@HhH!aッx◀⁸✽3🐱dセᵇ⁘をqj」r#웃d$☉6➡️■⁙き@!pHs\rᶠ!ひEBち5◀@(やセ♪jTホa…▤FXq むく\"b4,:●░░ノ⌂▥ˇᵇ◀tHしそる⁘웃TQ,'ぬIb⬆️▶웃V□¥、BるCCニき+@G%しね$¹*そ⁸drさ✽-b …▮ぬオ★★,;✽░●のん◀E❎\rRnて⁘し⁶w□ハ<✽ち'」m✽5T❎え■dZ8●░✽░░…Fほb+🐱@L~\0⁸➡️¥)☉😐つ_😐ねらキEp⁴🐱♪\tᵉaろ9▥ヲヘさキリろそBT*@き^b➡️🐱ルC-8し⬆️:ˇ!`♥▮ぬs웃#Dp웃▮えH)▮そ\"‖)ˇJ★:∧)▮1…I⬅️⁸たへりケ9りヲ&ろ웃⁘*%★M!\"ˇdは▮RむF']XHᵉ ●D♥pBナミ⁘ヒ¹ᶠiZるをサ-マさD…ケ☉🅾️ᵇ░DR5□[ˇJNaろ8らˇ⁙█M³⁷$22●3✽\"り)わのRHさフ웃$ュ■⁸スす⁸へF●🐱E➡️ ろM⁵…⁵➡️‖$q◀pヒZ⁸シFてつP$し(➡️ろラ🐱T⬅️ゃケ⬅️*X😐웃ᵇbま▮🐱W◀-G0▤さね&⌂ソ⁸✽さヌ…UぬG1⁸¥ゅヌ、Hの<ろM$∧Gナ4Mねo2イら■▮ニ][¹コ∧‖)ろ☉ゃa0L□S▤☉ぬスせVらオ*7¹•[C▥⁴□DJ✽つ*しbUB▮や'2まぬ²ヘ♥⁴F\"(キふ░➡️*ウM(‖E8Zのタ□☉5…□ウニ8*(▤=くC▤🐱オへI\"HQム6*⁵!◀ゅハ2Fる\"🐱ヨ\0:▥!み🐱□*Cユ³Pナ%●●カ²カ⁷r8…あゃ⁴\"*>ム*$$ $$'ふ‖⁷k⁴⌂よ░\t-□%웃B」けセ 0wっ、□☉XI、っ゜⬆️%WPュさ${アQ;き░たるこエ\n█4⬅️#◆░\0ˇカK\"e♪⁶#H…A🐱り 🐱ス★ᵉ!⁙⁷jく\"Bナ░🐱 マG)くア⁘⁴웃Qル웃!I!ニモそB……J …X⬇️まynprしXY★GP…Aく⁘0X~X-X♥2=わ~V⬆️。ゅュ%!ノ;⁴♥Pヌ、Cて、CR◆ョ2,?⁸!;\0ッ、`★★□¥ᵉ1\\Hも▒ョラ²□、r⁷…モ⁸ ♥キよᵉ`8りiHI⁴$?hs+…$y\tᶠサ⁸l⁸!ム?`○▮ャ⁷…CBゅH…ュ0yチ@!ア▮マ□¥⁸XX$$!ム$🅾️dqᵉ!aア4「░?9、りᶠるWr?ᶜ□゛るり\rᶠる◀゜ひ44=✽♥PモC▤\rᵇ🐱るJマG▮Cまyᵇ⁵ Hヤ⁷…モ。れも゛れてBF░░░♥0Cラ🐱¥、r²¥□、Aᶠ\0➡️$sニ■ᶜ$i゜░◆くノ🅾️ニヲh)\tᶠ 🐱◀◀⁸~▮オオCリ♥PBりᵉ!!くd~r?8sけ.\0░?h0$i゜う:♥ヤᶠミ⁷¥\"¥くき`ヒ゜ノ□<➡️くヲれ☉!ア▮`ヒ¥Dカ‖⁵‖゜ヲ${⁴>♥☉✽く▒ᶠラ¥、A⁴;✽✽✽✽♥…ヒ□、り⁸(◜き░🐱¥、b□▮Bれ☉wᵇᵇᵇᵉaル8🐱⁸L、りっ、Aᵉ¹シチャヲ◜?😐ネタウつルニム?⁸yᶠ`うむヒ³ヨ☉웃ノ8メエ、◜゛ョヲ'\\\0\0"

}
key = '_img_runes_glyphs'

keys = {}
for x in pairs(images) do
	add(keys, x)
end
index = 1
-- _img_formless_void = _img_magi_ritual

byte_values = {
    ["0"] = 0, ["1"] = 1, ["2"] = 2, ["3"] = 3, ["4"] = 4,
    ["5"] = 5, ["6"] = 6, ["7"] = 7, ["8"] = 8, ["9"] = 9,
    ["a"] = 10, ["b"] = 11, ["c"] = 12, ["d"] = 13, ["e"] = 14, ["f"] = 15
}
function hex_to_byte(high_nibble, low_nibble)
    -- Combine the high and low nibbles to create a full byte value
    local byte_value = byte_values[high_nibble] + byte_values[low_nibble] * 16
    return byte_value
end

function escape_binary_str(s)
 local out=""
 for i=1,#s do
  local c  = sub(s,i,i)
  local nc = ord(s,i+1)
  local pr = (nc and nc>=48 and nc<=57) and "00" or ""
  local v=c
  if(c=="\"") v="\\\""
  if(c=="\\") v="\\\\"
  if(ord(c)==0) v="\\"..pr.."0"
  if(ord(c)==10) v="\\n"
  if(ord(c)==13) v="\\r"
  out..= v
 end
 return out
end

-- Define a function to parse the hex string and write it into memory
function hex_string_to_p8scii(hex_string)
	local ret = ''
    -- Iterate over the hexadecimal digits in the hex string two nibbles at a time
    for i = 1, #hex_string, 2 do
        -- Convert the hexadecimal nibbles to a byte value
        -- assert hex_string[i] != nil
        local byte_value = hex_to_byte(hex_string[i], hex_string[i+1])
        -- poke(mem_start + i/2, byte_value)
        ret ..= chr(byte_value)
    end
    return ret
end

-- local p8scii = escape_binary_str(hex_string_to_p8scii(image))
-- print(p8scii)
-- printh('"' .. p8scii .. '"', '@clip')

-- res = 0
function _init()
		poke(0x8000, ord(images[key], 1, #images[key]))
		-- poke(0x0000, 1)
		-- poke(0x0002, 1)
		-- poke(0x0003, 1)
		px9_decomp(0,0,0x8000,sget,sset)
	-- img = images
	-- poke(0x8000, ord(_img_formless_void, 1, #_img_formless_void))
	-- -- poke(0x0000, 1)
	-- -- poke(0x0002, 1)
	-- -- poke(0x0003, 1)
	-- px9_decomp(0,0,0x8000,sget,sset)
	-- -- memcpy(0, 0x8000, 0x1000)
	-- -- cstore()
end

function _draw()
	local doit = false
	if btnp(0) then
		index -= 1
		if index <= 0 then
			index = #keys
		end
		doit = true
	end
	if btnp(1) then
		index += 1
		if index > #keys then
			index = 1
		end
		doit = true
	end

	if doit then
		key = keys[index]
		poke(0x8000, ord(images[keys[index]], 1, #images[keys[index]]))
		-- poke(0x0000, 1)
		-- poke(0x0002, 1)
		-- poke(0x0003, 1)
		px9_decomp(0,0,0x8000,sget,sset)
	end

	-- cls()
	palt(0, false)
	spr(0,0,0,16,16)
	palt()
	-- print(res,7)
end


function
	px9_decomp(x0,y0,src,vget,vset)

	local function vlist_val(l, val)
		-- find position and move
		-- to head of the list

--[ 2-3x faster than block below
		local v,i=l[1],1
		while v!=val do
			i+=1
			v,l[i]=l[i],v
		end
		l[1]=val
--]]

--[[ 7 tokens smaller than above
		for i,v in ipairs(l) do
			if v==val then
				add(l,deli(l,i),1)
				return
			end
		end
--]]
	end

	-- bit cache is between 8 and
	-- 15 bits long with the next
	-- bits in these positions:
	--   0b0000.12345678...
	-- (1 is the next bit in the
	--   stream, 2 is the next bit
	--   after that, etc.
	--  0 is a literal zero)
	local cache,cache_bits=0,0
	function getval(bits)
		if cache_bits<8 then
			-- cache next 8 bits
			cache_bits+=8
			cache+=@src>>cache_bits
			src+=1
		end

		-- shift requested bits up
		-- into the integer slots
		cache<<=bits
		local val=cache&0xffff
		-- remove the integer bits
		cache^^=val
		cache_bits-=bits
		return val
	end

	-- get number plus n
	function gnp(n)
		local bits=0
		repeat
			bits+=1
			local vv=getval(bits)
			n+=vv
		until vv<(1<<bits)-1
		return n
	end

	-- header

	local
		w,h_1,      -- w,h-1
		eb,el,pr,
		x,y,
		splen,
		predict
		=
		gnp"1",gnp"0",
		gnp"1",{},{},
		0,0,
		0
		--,nil

	for i=1,gnp"1" do
		add(el,getval(eb))
	end
	for y=y0,y0+h_1 do
		for x=x0,x0+w-1 do
			splen-=1

			if(splen<1) then
				splen,predict=gnp"1",not predict
			end

			local a=y>y0 and vget(x,y-1) or 0

			-- create vlist if needed
			local l=pr[a] or {unpack(el)}
			pr[a]=l

			-- grab index from stream
			-- iff predicted, always 1

			local v=l[predict and 1 or gnp"2"]

			-- update predictions
			vlist_val(l, v)
			vlist_val(el, v)

			-- set
			vset(x,y,v)
		end
	end
end

__label__
d36cdcddcddcdcddcd3dc53dc53d3dcdd7c3d3d353d3d3d3dcd66cdc666677777777676777777777777777777677777677777777777777777777777777735b77
3cd6bdcbdcb6c6bcdbcd3cd3dcd3c3d33663d3d3dc1d3d3c3d6666c6c6c6666777777677777776767677777766777766777677777777777777777777777db677
d33c66cdbdcdbdcdbdc3d3dc33cd3d3d336cdc3c3d3c3cddc6c66666b66c6667776767667776777777777677667777667766777777777777777777777773bd77
dcd3c6dcdcbdcd3dcd3dd3d3dd3d3d3c5cd6cdcd3d3dd3cd666667666c6666676777767776777677777766776c777766777677777777777777777777777dbb77
3d3d3c66cdcdbdc3d3d3c3d3c3d3d3d3d33d6cb6c3d3cddc6c6666767666667677777777776777777777667776777766776677777777777777777766776bd677
dc3cd3cb6b6cdcbdc3cd3cd3d3d3c3d3c5c366cd6c3d3c6b66666676666667677777767767767777777766776c77776677667777777777776b6777db777dbb77
3cddbddc66c6bdcd3d3dcd3c5c3d3dc53d3d366cd66c6dc6c6c6c6667767667677677777767776776777667766777766776c7777777777773377776b7773b677
6c6c6cbdc6676cdbcdcbd3d3d3d3d3d3cd3cdc66bc6666666c666c6c6676766767777677776777777777c677667777667766777777777777db6777d6777dbd77
cdb6c66c6667776cdbdcdc3dc3dcdc3cd3cd33c6cd6c666666cb6c66667666767676777677767777777766776c6d66cb6666777776777777b37777b6776b5b77
dcdcbcdcbc677766c6cdbdc3dc3dcbdcdc6c6cb66cb66666766c6c6c666666666767777776777677767766d36333d66dd666777777777777db67776b777db677
cbdcddb6c6c6677766c6cdb63dcb6cd6c6bcbddc66cc666666c6c6b6c66c666c76776767777677767777c3353d5b666bdb6c677777777777db6777d6776bdb77
dcbdcbc66cbcc676666c6cdccbdcdcbc6b6cdcbdc66bc66c666666c6bc66c6666676777676767777776d3553d535d665d6b6b777777677773b7777b6777dbd77
cdc6b6c3c6666c7777766cb6cdcdbdcdbcdcb6cdb666c6c66cc6c66c6c666c6c666766777677677777c353553553ddbdbdd6d77777777777db67776b776bb666
dbcdccd6bccbc667777766c6bcbcdcb6cdcdcdbcdc66cb6c66c6b6c6c66c6666666677676767767777d3553555dbdfd36b66b777777777773b7777d6777dbb6d
c6cb6bcc6cd6cc6c7777776c6c6dc6cdbcb6bcdcbcc67c6cbcb6c6c6b666c6c6c767677676767776763535535355d663ddd6667777777777db67776b7773db75
c6c6c6cbcbc6b6c6677777666cbcbcbc6cdcdc6b6dbc76c666c6cb666c66c6c66667667667666767763553535d33666ba36b667777777777db7777b6777bdb7d
6bc6cb6c66ccc6bcc6777777666c66cdcb6cb6ccc6c6c66c6cb6c6cc66c66c66c76676776666677776353555d355b665dbf6b677777777773b677ddd776dbd6d
c66c6c66c6c6bc6c6c66777666c6cb6c6c6c6cb6bc6bc66666c6cb6cb6c6c6c6666666666666767676355313dd35666b5d66667777777777dbd673b6777bdbfd
6c66c66c6c666c6c6cc7677766666c6c6b6cb66c6c6c6b76cc666c66c66c666c6c6666766676767776353553db53d665bd66b67777777777b5b77d5d776dbd6d
66c666c666c6c666c66c77777777776666c66c66c6bc6cc766c66cc6c6c66c66c666c7667667676666355355d555bf635d6b667777777777dbd763db777bbbfd
6666c766c6666c6c66c666677766c76666766c6c6666c666666c666c66c6c66c66c666666666666676353513d5356665b5f6b77777777777b53773d6777ddb75
c6c66c6c6c6c6666666c6c66777766c666666766c6c66c6c6666c666c6666c666666c66c7666666666355535db53d66b5d66d67777777777dbd773db776bbd6d
66c6c66666c66c66c666666c67776666c66666676676c66c6c6c6c6c66c6c666c666666666c76666763535156555b7655bf6b67777777777b3d673d6777dbd65
6c766c6c6c7c66c76c6c66c76c7777c666676c666667766666666666c66666c7666666666676666666353553d353666b5d66667777777777db5775367763bb6d
66c666666666666c66cd6666666677766666666c66c6c66c7666c6c666c6c6666c66c6666666667676355353d55556653d6b667777777777b5b763dd7765ddd5
66666c66c66c6c7666cb66c66666777666666666666666666c7676666666676c7666766666666766763535555353d6b55bfdb67777777777d3d773db7765bbd5
666666666666666c66dd3c666666676776c6676666c7c6c66666666666666677666666666676766766351535d355b665bd66667777777777b3d673d677d5bdd5
766666666666666766cbdb666666777677766666c76676666c66666666667666666666667666676776353513d535d6bd556b667777777777dbd7653555d5bb53
766767666666666666dd6b6c766677766676c76776666c6667666666666666767676676667677677763553553553565db566b67777777777b3ddb51355d3d531
766676666666666666cbd6b676677776666776676766666666666677666676676767667767676767763535155355b65d5556d67777777777d335110553d5b530
7777677767666666666b6b6c7677777666777667676666c66666666676676767667676676767677776351313553556b5bdb6b77777777777b550351515551350
777777677777777776cdbdb67766777676667767777766666666767767676767676767767777776766355515535356d5bdfd667777777777d351503551d35305
77767777776777676b6b6d6c77c667776767677666766c66c666776777767776777677777676776666531353d555d6db5d6b6677777777773030305055d55301
77677677677777776cbdbdb6776b667676767676776766666c666677767776777677767677777766c6355515db53bd655bfdb677777777775355050315530510
7776776776766767cd6ddd6b776cdc7767676767677666c666c6677777777777777777777777776666535353d535d6b55d666677777777763510305155551350
76776776776776776bb6bdb677cb6b66776776777676c666b66b7676777677777777777777777766663535155553da65bd6bd677777776763535050505d31030
77777777677767776ddbdd6c776d6cb66777777677766666c666667777777767776777777777776666355535db55d6d35df6bf77777776765105031355d53505
7776776777677767cb6d3db6776b6d636677767777766c66b6c6667776776777777777777777776667353535d535b6db5b6d667777777676335030515d355030
77777777777777776dbddb6b776c66d6c6777777777c66b666b66677777777776777776777777766c7535513db55d6655dfb6677777776763053050555553050
7777777767777777cb63d6b6776db6b6667777777776666c66c666777777777777776c67777777666635153565536b635b7d667777777666bd55d56ddd351305
77777777777777776dd5bd6b77666d6b667777777766c6666b6b767777777777777666677777776c67535535d353d6d53dfb66777776c6bdddbd667776510530
7777777777777777bdbddb66776bcb6dc7777777776c6b6c66c666777777777777c6b6677777776666353535535555b5556db77777d353553553d6777d315011
7777777777777777d65db6bd676666d6b77777777766666b6b6b766c67777777766c6c677777776b7653553b6535b6d5bd66d67777353513035567777d503503
7777667777777776cbd5db6b776cd6b6d7777777776c6b66c6b66c666667777776b66b777777776666353555d535d6a35d6b66777d311505105367777d350350
7776667677777777dd3db6dc776db6dd667777777666c6c66b6c66b666667777766666677777776c663515335355b5d35b65667763515030535567776d150530
6766676677777776b65db6b66766666bc677777776c6b66b6b6b6b66c666777776cb6c677777776666353535553555b555db66777d303505003567776d535350
6676667677777777d3db636b776b6b66d67777776c666b6cb6d6c6666666777776666b777777776b76535533d355ddd53d6db77765350530355377776d350301
6666667677777776c5ddb6b6676cd6db66777776666b6c6b6b6b6b6b6666767676c6b676777777666d35353555b5b6bd5bfd667765150305015567776d553501
6c66667667777766b5bddb6b77666d66d6676776c6c66b6ddb6bdd66c666676766b666666777766bdd353535b555d5b55d6bdf7763530515031577776d350530
6666666677676766d5db6db6676db6b6b666667666b66b6b6db6bdb6b666666676666b7666777666dd554b55d535bd653d6db77765105030505377776d535030
db66c67666c666663db6b6db776666dd66666766c666b6d6b6bddb6b66c6667666b66666dd6cd666d36dfd33d355ff65356b667663530530315d677763553051
666b666666666c663ddbdb6d666bdc6b6c6666666b6b6bdbdddd6db6cbf66666666c6b76336d3d666d666b55b55d66b55bfddf6765153050503577677d503530
db6666666c66b66d5bddddbb76666b6dd6b6666c666c6ddd35dbddbd66666666666b666d3dd6bd3b7676355dd55b66b55d6b667763505035035d677763535050
666666666666666bddb6b6d6666b66d6b6666666b6b66666d35dddb6b66b766666666b6d533d5515f76dbd6b5b5d66635bfdd66765030501503577776d505301
db66b6b66b666b6d5dbdbdbb6b6dddb6d6b66666b6ddb6666b5dda366666666666b66773555535356763d555d55b6b635d6b66f763513503055d677765353050
66d6dd66666b7663dbd6b6db666d66ddb666666c6353dd66bd6dddbbdb66666663d667653355355367635b5bdb55b6b55bfdb67665305030503d67776d535305
ddb6dbd6b66666bdddbddb6b6db6bdb6d66b666bd53d563dbd776bdddbdb6666dbd366c5153d503567635555555b66635d63dddd350503503153777763511531
666666666c666665bddbdb6db66d66ddb6d66666b5535d5bd5775dbdddb66666d53d66b513553503f665355db55dbb653565d5bd55315050505d777765135301
db6b766b6bdb6b66d6b6b6b666bddb6d6d6b66663535dbd5bd77355b55db6666bd35b6651535535b77635d355b536b55356b5555351313050353777763053051
d3d666b6ddb6b66b6b6666db6b66dddbd6b766663553dd555d77d35d35db6666d55dddd350553515676355535d53bab55bf5553d53150503053d776765105350
ddb666d66db66b6d365d66b6d66b6d6db666d66635353653bd77355bd3db66d6b535b6b55355535367635b555b5dbdd355635d5555030350505d677763035030
3ddd66b6bd6b6bddbdbd666b6bd6db6ddd6b666d3555d5b55d77d35555b6da66535ddd650535350567635555b5555b55356515d3d31505031353777765153505
dbd666d6ddb6d66ddddb66bddddb6dab6a3ddbf63535365535773553d55b6366353535d3535553536763535555335535356353d551105305015d777761030530
5dbd66b66db66666bbdd66ddbdd6dddd366d6ddb5513dd535d775355b5dbddd3555d53d53153513566635515355353515563555d35130503503d777763053501
d5d666d6bddb666d6ddb66b6dbdbdbdddd35bd6d53553d553d775535535a3d5d353535d35155350567655513535305350565553d53150310155d677765053031
3dbd6b66ddb6666bd6bd665bddd646db6d55d3dd3d355db535773515d35b6535535d535515355353676353505135305353d535d155035050303d777763053550
dbdd66d6bdbd66656dd366b6dbd6f6f7f635353d5d53dd553d77d3535bddbd53553555d35355355566665535155553556f65553d35105305055d6777d5035030
5ddb76b66ddbda6bd6bd6dddd5b6f66666d5d555b635bd5355773555553d55515353535505553535d666b511355dd53556fd35d5535105035036677763003530
dbdd66d6bdbadd63ddd366bdbddd6bd3535353d5dd355db53d77d353535bd5355155555353551153533dd31556b6bdddd6bdd5d3d5130350315d777761505050
5dd666b6dddbdd65bdbd6ddb65db5d53d555553d35555d5555773515b5dbd551353d31d515353505555351113ddd66666b6d666761051505053d677763035301
db6d66d6dbdb6dbdddd366bd5dbdd6355353d3d55353dd353d775535555a35551555515315551053531515055353d3d6d6ddc667d313030301566777d5105031
dddb76d6bdda366553db6ddddad66bd5555d5d5353553d5535773553533bd53513135355315353555511313010511533d3dd666763050515035d777763053503
777776b6ddbdd66dddbd66bdbd66665d35353d3555355db55d77535555dbdd51555551d30555015351551505110535111533db66d5150305053d7767d5030050
767666d6d5abdddb66656d6d6dbdb353d515d55135135d533d7735535355353531353555135353555315115015051510501551dd350305030156677763053530
d3dbdb66bddb6d666b5b35b533d355d3d3535d3515355d555b77535535135d6d5555515351551b51dd35130503053511050511d653150305035d7777d5105010
ddb6ddd6ddb666abdd555353553535b5d3553515315536353d77353511515577d335355351535505dd35051355110503050351dd5530515050366777d3531350
b6d5b6b6bdd6a6ddd3353535355355353d666d6151355d555d76511153035df6d5555dd531550313dd53105015553515011510d3510503030556677761053050
d5b6dd65d6a6666355353553535535355bd677d315055db535663153055135f7d53d666315305050dbd15105010355355105355535130505135d7777d3505301
56d66a665f66f6dbd53553d5d53d53553535d6d353535d55356d3105303555ddd353dbd501513053dd51035030511105355d51555305030501367777d5035031
66666767f77665d656d6d6d6b6d6d6dddddd3d3510535db5156d3515150513db65baba3515305105dd3510501015505051353dddd530505035566777d3535350
766b66b6bdbbbbbbbbab633dd3d33d3ddd3dddd353555d53156d30530530555535b5b505030503535d35150305053011010511535051303050367767d5503050
d6bdbabdba5d4da5ab666d53d5d5d3d3d3d3d35115035d30536d350530535313535b431350515005db51503050151505105350d55305050503566777d3535030
5ddadddaddbdb5535567d3d51353155d35d535d305535555156d513051151553535b5050513013535d51305051051010501503555113530351567777d5305350
db5bdbdb5bd5a3d5bd6f7dd355515535513d53555355dd355ddbd515535353535355350315050505dd35111555351305030511553500305003567777d3503050
b5b5bab5babbbbbababd6bd53d3535353d515551553df655335533530535353505305035035030535d51050135d35510505510d55135050515367767d1555311
dbab5b5b4b5a54bb5b5bbabbabd5d5d66db535353d5666b553530505350555053515355150515105db51503050155355311353553105035030d67777d3530530
db5b4b4bb4b3bb4ba3b4b5b5b5bdddd6d6b6b5b55353353530353535535355355135155305303530dd531505011115555555155d5530503053567777d0535053
56b4b4b4b4b4a3a35b4b4b4babab66babab5ab5353553553555555535155151515155115105101053d35015051505135535d3566d305050505567677d3053503
556bab5bab6b5bab5bababdab666ba3bdb5b5b4b5353535353535351505151115050350353153535dd51503153515553555d5d67d053031313d67777d5531301
535ddba3dbadadbda3dbda6666bb5b4b5b4b5b5b4b530535353555551515351503551551050501053d313050555353dd53536676d305050505367777d3053550
555d6b65a6dbdbdb6ba66b66b55b4b5b4b5b4b4bb4b535035053535d3553555355351513503153515d51501151535553d5dd66673513050305d6777751305303
dbdb5db6bdbababababba66babb4b4b4b5b4b5b4b5b55353535355d555dd5d3551551350535050355d351505051153555353dc675115035053567777d0530530
bababab5bab5bdb5b55bbad53dab5b4b5b4b5b4b4b9bbab53555d3531113551511535151150535053d5035035311051355d5dd66d303501305d67767d3005050
5b53b5ba3b5b4b4b4babdbbdb5bdabb9ba35ab5babbabad555b53535151111115155515305310535dd3511505551501111353d66351050505356777751053303
35b4b5b5b4b4bbabbab6a6b4b4b5b5b5b5bbdba6d6666d66b55353535151555153153555151511535d51503111151105151155665530313015d67777d3030501
b4b5b9b4b4bababab666bb4bab5b4b4b4b4b4b5bbab6babb53505350351505315551551355135151535031050503555011515366350505053537777731505030
5bb9b3b4babba667776b5b5b5b5b5b5b5b5b4b5b4b5b5b5b435351355353515555d315515355515050511505015010535011555d5130503015d67777d0135051
b4b5ada666f6777766b5b9b535b4b55b55b4b5b4b5b4bb4bbb5353503555555d355511535d1515351515051051050511550315111505035053d7777753053130
7777777776777767d5dab5b5b4b53b55b5b5b5b5b4bb9bb9bab53053553dddd3d51d511555115515153115050511101053515153153050503557776751503050
776666666676676753ddddada3db95b5b5535b5b4b4bb4bbabba355d5555353511111511115115151515053113505305155153505153030503d7777753035030
6d66666667667676d13d66666666666f66adda5babb9baba6ff7d53511155d5551531355353535353530515551510510511535115305150355d6777751053550
66766767677767665553353d6dddd6d66d66666666f67777777635153535353353535531553553553053135510151050530511505150305035d7777735305031
7777777777767677d35155dddb55353535353dddd66777766db535b5b5bb5b5b5b503050305030505305050351505305150151051305053053d7776750533050
777777776767776d5555dd666d5d55555555535355dbdbdbbb5bb4bb5b4b5b5b5b535035030350303053035015030510111515105531305053d7777751055031
6666b666677765115155d66a6655d5d55dd3d535bbb5b5b4b4b9b5b4b5b5b4b5b535b50355150535050505030305105153051350130505035566777735033503
bbbbabbba66d355d5553556666dbd55db5b5b5b4b4b4b4bb4bb5b5b5b4b5b5b55b5b5b53553030503530305150505101050515051505035035d7777751153510
5b4b5b9bbba35d765b553535bfddd5b5b5b9b5bb4b5b5b4bb4b5b5b4b5b5b5b5b5b5535b5b535530505053030350305505115150535030515367777730135030
b4b9b5bb9bbfd7655d535135556fbab5b4b5b54b5b4b5bb4b5b5b4b5b5b4b5b5b55b5b5b535b53533503051511305130501505305035050355d7767751503550
5bb5bb4bb4bba765355515556bbb4b5b4b5b5bb4b5b5b9b5b5b4b5b5b5b5b4b5b5b5b5b5b5b5b5b5335353035050305035035151550513503566777731053530
b4b4b9b4bab4bdababdbababab9bb5b5b5b4b4b5b5b4b5b5b4bb4b5b4b5b5b5b4b5b5b4b5b435b535b5353503535053050551551315030505367777755353050
b4bb4bb5bb4bbb5b5babb5bb5b555b4355b535b535b5b535b5b4b5b4b5b4b4b5b5b4b5b55b5b55b5b535b5350503505035035535530505035566777730053530
5b4bb4bab4b54b5b5bb4bb4b4bb5b5b535353535b5b5b5b5b4b5b5b5b4bb4bb5b4b5b5b5b5b4b5b4b5b535353050305305305551550350513567777751535051
b5b9b5b5bb4bb4b5b435b4b5b4b5b55b53535b535b55b55b5b5b4b4b5b4bb4b5b5b5b4b5b5b5b5b55b4b5b535135053505053155315031305367777631053530
5bab5bab4bab4bb9b5b4b5b4bb4b5bb5b533535355b55b5b4b55b5b5b5b4b5b5b4b5b5b5b5b55b4b5b5b4b5b5053530531350355513505053567777751130501
b4b5b4bb9bbabab3b4bb4bbabababad55b53533533533535b43b5b4b4b5b535b4b5b4b9b4b4bb9bb5b5b9b4b535505305050353db10505355367777630503530
bb4bab5bb4b5bababababaa6666766666664b4b5353535353355b5b5b4b5b5b4bb4bb5b5b5b4b5ba5b4bba6b5531305303530505551305015367777751153503
4bab3b9b4bababbababba666666d6ddddd666665b535353535b55b5b4b5b5b4b4b5b4b4b5b5bab5bbab4b6b4b53505051105353d315053503567777635035305
b5b4b9bdbabdb5babba67776666dd35b53db6d666fdb4b53535b555b5355b4b5b5b4b5bab5b5b5b934bab5bab513530353505155511501355367777713503505
5bab5b5babb4babdabab7766666dd55d55553dd66667665b55353b55b5b5b535b4b5b4b5b9b4ba3b4bfb5b4bb53005305035353d350305015567777650535530
b4b5bab5b5bab5bbbfbab77666d6555515315533dd6666766a355353535b4b5b5b4b5b5b5bbab34bab5babbaba35305535551551535050503567777631053053
5b5a3b4bab5b5babababa6766666d35d35511551535d6d666676a5353535b5b5b4b5b5b4b4b5b5abbabababab435553551315151505db5351567777651305303
b4bb4ba335b4b9b5b5b6bb77666655d51551555155353d666666776adb535355b5b5b4b5b5b9bbbababbabf77653551515155dd53535aba35367777630535350
5b4ba3b5b4bb9b3babababd77766d3d55515551555155dbdb666667676fab4b5b4b5bb4b5b4baababfa67777763d13513535ddd3535035bda666776d50505035
b5b5b5b9bbabb5ab5bb5bab6776655535535535153555d5553dc6666777777f6fbadababaaba666f777777776d3515151015db653053534bdb65dd6351035350
5b5bab4b4b5b9bb5bababbab77d35515115155535155dc5355553dc6666677777777777777776777777777763515515303536dd305303535adbbd66503553505
b4b5b4bbababb4babb9baba77760101010515355d555d3551153553dc66666677777777777777777777676655515513551356d35050503533b9bab6d55355531
35b4bb4b5bdb9bbab4bba66bf76510505010511515d3d5555551155353db6666666767777677676766667663553515303555db1530305305535b5aa6ccbb94dc
b5bb4b5bababb9b5baba6bf6677d50101051105153dd5d3553551555155d3dc6c66666666666776767666655d1513535135dd503050305030534bbaac6ba44dc

__meta:cart_info_start__
cart_type: game
# Embed: 750 x 680
game_name: Game Template
# Leave blank to use game-name
game_slug: 
jam_info:
  - jam_name: TriJam
    jam_number: XX
    jam_url: null
    jam_theme: 'XXX'
tagline: XXXX
time_left: '0:0:0'
develop_time: ''
description: |
  
controls:
  - inputs: [X]
    desc: XXXX
hints: ''
acknowledgements: ''
to_do: []
version: 0.1.0
img_alt: XXXX
about_extra: ''
number_players: [1]
__meta:cart_info_end__


